[Killed] BlockStatement
algorithms/graph/graph.js:1:28
-function bfs(start, graph) {
-  if (!(start in graph)) return [];
-
-  const result = [];
-  const queue = [start];
-  const visited = new Set([start]);
-
-  while (queue.length > 0) {
-    const node = queue.shift();
-    result.push(node);
-
-    for (const neighbor of graph[node] || []) {
-      if (!visited.has(neighbor)) {
-        visited.add(neighbor);
-        queue.push(neighbor);
-      }
-    }
-  }
-
-  return result;
-}
+function bfs(start, graph) {}
 
 function dfs(start, graph) {
killedBy: BFS simple graph traversal
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [2, 0, 3, 1]
Received: undefined

[Killed] ConditionalExpression
algorithms/graph/graph.js:2:7
 function bfs(start, graph) {
-  if (!(start in graph)) return [];
+  if (false) return [];
 
   const result = [];
killedBy: BFS start node not in graph returns empty array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   5,

[Killed] ConditionalExpression
algorithms/graph/graph.js:2:7
 function bfs(start, graph) {
-  if (!(start in graph)) return [];
+  if (true) return [];
 
   const result = [];
killedBy: BFS simple graph traversal
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   2,
-   0,

[Killed] ConditionalExpression
algorithms/graph/graph.js:8:10
   const queue = [start];
   const visited = new Set([start]);
 
-  while (queue.length > 0) {
+  while (false) {
     const node = queue.shift();
     result.push(node);
killedBy: BFS simple graph traversal
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   2,
-   0,

[Killed] EqualityOperator
algorithms/graph/graph.js:8:10
   const queue = [start];
   const visited = new Set([start]);
 
-  while (queue.length > 0) {
+  while (queue.length <= 0) {
     const node = queue.shift();
     result.push(node);
killedBy: BFS simple graph traversal
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   2,
-   0,

[Killed] BlockStatement
algorithms/graph/graph.js:12:47
     const node = queue.shift();
     result.push(node);
 
-    for (const neighbor of graph[node] || []) {
-      if (!visited.has(neighbor)) {
-        visited.add(neighbor);
-        queue.push(neighbor);
-      }
-    }
+    for (const neighbor of graph[node] || []) {}
   }
 
killedBy: BFS simple graph traversal
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Array [
    2,
-   0,

[Killed] ConditionalExpression
algorithms/graph/graph.js:12:28
     const node = queue.shift();
     result.push(node);
 
-    for (const neighbor of graph[node] || []) {
+    for (const neighbor of false) {
       if (!visited.has(neighbor)) {
         visited.add(neighbor);
killedBy: BFS simple graph traversal
statusReason: TypeError: boolean false is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
algorithms/graph/graph.js:13:35
     result.push(node);
 
     for (const neighbor of graph[node] || []) {
-      if (!visited.has(neighbor)) {
-        visited.add(neighbor);
-        queue.push(neighbor);
-      }
+      if (!visited.has(neighbor)) {}
     }
   }
killedBy: BFS simple graph traversal
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Array [
    2,
-   0,

[Killed] ConditionalExpression
algorithms/graph/graph.js:13:11
     result.push(node);
 
     for (const neighbor of graph[node] || []) {
-      if (!visited.has(neighbor)) {
+      if (false) {
         visited.add(neighbor);
         queue.push(neighbor);
killedBy: BFS simple graph traversal
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Array [
    2,
-   0,

[Killed] BlockStatement
algorithms/graph/graph.js:23:28
   return result;
 }
 
-function dfs(start, graph) {
-  if (!(start in graph)) return [];
-
-  const result = [];
-  const visited = new Set();
-
-  function dfsHelper(node) {
-    visited.add(node);
-    result.push(node);
-
-    const neighbors = [...(graph[node] || [])].sort((a, b) => a - b);
-    for (const neighbor of neighbors) {
-      if (!visited.has(neighbor)) dfsHelper(neighbor);
-    }
-  }
-
-  dfsHelper(start);
-  return result;
-}
+function dfs(start, graph) {}
 
 function dijkstra(graph, start) {
killedBy: DFS simple graph traversal
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [2, 0, 1, 3]
Received: undefined

[Killed] ConditionalExpression
algorithms/graph/graph.js:24:7
 }
 
 function dfs(start, graph) {
-  if (!(start in graph)) return [];
+  if (false) return [];
 
   const result = [];
killedBy: DFS start node not in graph returns empty array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   5,

[Killed] ConditionalExpression
algorithms/graph/graph.js:24:7
 }
 
 function dfs(start, graph) {
-  if (!(start in graph)) return [];
+  if (true) return [];
 
   const result = [];
killedBy: DFS simple graph traversal
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   2,
-   0,

[Killed] BlockStatement
algorithms/graph/graph.js:29:28
   const result = [];
   const visited = new Set();
 
-  function dfsHelper(node) {
-    visited.add(node);
-    result.push(node);
-
-    const neighbors = [...(graph[node] || [])].sort((a, b) => a - b);
-    for (const neighbor of neighbors) {
-      if (!visited.has(neighbor)) dfsHelper(neighbor);
-    }
-  }
+  function dfsHelper(node) {}
 
   dfsHelper(start);
killedBy: DFS simple graph traversal
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   2,
-   0,

[Killed] ConditionalExpression
algorithms/graph/graph.js:33:28
     visited.add(node);
     result.push(node);
 
-    const neighbors = [...(graph[node] || [])].sort((a, b) => a - b);
+    const neighbors = [...(true)].sort((a, b) => a - b);
     for (const neighbor of neighbors) {
       if (!visited.has(neighbor)) dfsHelper(neighbor);
killedBy: DFS simple graph traversal
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] LogicalOperator
algorithms/graph/graph.js:33:28
     visited.add(node);
     result.push(node);
 
-    const neighbors = [...(graph[node] || [])].sort((a, b) => a - b);
+    const neighbors = [...(graph[node] && [])].sort((a, b) => a - b);
     for (const neighbor of neighbors) {
       if (!visited.has(neighbor)) dfsHelper(neighbor);
killedBy: DFS simple graph traversal
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Array [
    2,
-   0,

[Killed] BlockStatement
algorithms/graph/graph.js:34:39
     result.push(node);
 
     const neighbors = [...(graph[node] || [])].sort((a, b) => a - b);
-    for (const neighbor of neighbors) {
-      if (!visited.has(neighbor)) dfsHelper(neighbor);
-    }
+    for (const neighbor of neighbors) {}
   }
 
killedBy: DFS simple graph traversal
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Array [
    2,
-   0,

[Killed] ConditionalExpression
algorithms/graph/graph.js:35:11
 
     const neighbors = [...(graph[node] || [])].sort((a, b) => a - b);
     for (const neighbor of neighbors) {
-      if (!visited.has(neighbor)) dfsHelper(neighbor);
+      if (true) dfsHelper(neighbor);
     }
   }
killedBy: DFS simple graph traversal
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ConditionalExpression
algorithms/graph/graph.js:35:11
 
     const neighbors = [...(graph[node] || [])].sort((a, b) => a - b);
     for (const neighbor of neighbors) {
-      if (!visited.has(neighbor)) dfsHelper(neighbor);
+      if (false) dfsHelper(neighbor);
     }
   }
killedBy: DFS simple graph traversal
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Array [
    2,
-   0,

[Killed] BooleanLiteral
algorithms/graph/graph.js:44:7
 }
 
 function dijkstra(graph, start) {
-  if (!(start in graph)) return {};
+  if (start in graph) return {};
 
   const distances = {};
killedBy: Dijkstra simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "0": 0,
-   "1": 3,

[Killed] ConditionalExpression
algorithms/graph/graph.js:44:7
 }
 
 function dijkstra(graph, start) {
-  if (!(start in graph)) return {};
+  if (false) return {};
 
   const distances = {};
killedBy: Dijkstra start node not in graph returns empty object
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Object {}
+ Object {
+   "5": 0,

[Killed] ArrayDeclaration
algorithms/graph/graph.js:48:15
 
   const distances = {};
   const visited = new Set();
-  const pq = [[start, 0]];
+  const pq = [[]];
 
   distances[start] = 0;
killedBy: Dijkstra simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
    "0": 0,
-   "1": 3,

[Killed] EqualityOperator
algorithms/graph/graph.js:52:10
 
   distances[start] = 0;
 
-  while (pq.length > 0) {
+  while (pq.length >= 0) {
     pq.sort((a, b) => a[1] - b[1]);
     const [node, dist] = pq.shift();
killedBy: Dijkstra simple weighted graph
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
algorithms/graph/graph.js:52:10
 
   distances[start] = 0;
 
-  while (pq.length > 0) {
+  while (false) {
     pq.sort((a, b) => a[1] - b[1]);
     const [node, dist] = pq.shift();
killedBy: Dijkstra simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
    "0": 0,
-   "1": 3,

[Killed] MethodExpression
algorithms/graph/graph.js:53:5
   distances[start] = 0;
 
   while (pq.length > 0) {
-    pq.sort((a, b) => a[1] - b[1]);
+    pq;
     const [node, dist] = pq.shift();
     if (visited.has(node)) continue;
killedBy: Dijkstra simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "0": 0,
    "1": 3,

[Killed] ArithmeticOperator
algorithms/graph/graph.js:53:23
   distances[start] = 0;
 
   while (pq.length > 0) {
-    pq.sort((a, b) => a[1] - b[1]);
+    pq.sort((a, b) => a[1] + b[1]);
     const [node, dist] = pq.shift();
     if (visited.has(node)) continue;
killedBy: Dijkstra simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "0": 0,
    "1": 3,

[Killed] ConditionalExpression
algorithms/graph/graph.js:55:9
   while (pq.length > 0) {
     pq.sort((a, b) => a[1] - b[1]);
     const [node, dist] = pq.shift();
-    if (visited.has(node)) continue;
+    if (true) continue;
     visited.add(node);
 
killedBy: Dijkstra simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
    "0": 0,
-   "1": 3,

[Survived] ConditionalExpression
algorithms/graph/graph.js:55:9
   while (pq.length > 0) {
     pq.sort((a, b) => a[1] - b[1]);
     const [node, dist] = pq.shift();
-    if (visited.has(node)) continue;
+    if (false) continue;
     visited.add(node);
 

[Killed] ConditionalExpression
algorithms/graph/graph.js:58:38
     if (visited.has(node)) continue;
     visited.add(node);
 
-    for (const [neighbor, weight] of graph[node] || []) {
+    for (const [neighbor, weight] of false) {
       if (weight < 0) throw new Error("Negative weights not allowed");
       const newDist = dist + weight;
killedBy: Dijkstra simple weighted graph
statusReason: TypeError: boolean false is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
algorithms/graph/graph.js:58:57
     if (visited.has(node)) continue;
     visited.add(node);
 
-    for (const [neighbor, weight] of graph[node] || []) {
-      if (weight < 0) throw new Error("Negative weights not allowed");
-      const newDist = dist + weight;
-      if (distances[neighbor] === undefined || newDist < distances[neighbor]) {
-        distances[neighbor] = newDist;
-        pq.push([neighbor, newDist]);
-      }
-    }
+    for (const [neighbor, weight] of graph[node] || []) {}
   }
 
killedBy: Dijkstra simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
    "0": 0,
-   "1": 3,

[Killed] EqualityOperator
algorithms/graph/graph.js:59:11
     visited.add(node);
 
     for (const [neighbor, weight] of graph[node] || []) {
-      if (weight < 0) throw new Error("Negative weights not allowed");
+      if (weight >= 0) throw new Error("Negative weights not allowed");
       const newDist = dist + weight;
       if (distances[neighbor] === undefined || newDist < distances[neighbor]) {
killedBy: Dijkstra simple weighted graph
statusReason: Error: Negative weights not allowed

[Killed] ConditionalExpression
algorithms/graph/graph.js:59:11
     visited.add(node);
 
     for (const [neighbor, weight] of graph[node] || []) {
-      if (weight < 0) throw new Error("Negative weights not allowed");
+      if (false) throw new Error("Negative weights not allowed");
       const newDist = dist + weight;
       if (distances[neighbor] === undefined || newDist < distances[neighbor]) {
killedBy: Dijkstra graph with negative edge throws error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Negative weights not allowed"

Received function did not throw

[Killed] ArithmeticOperator
algorithms/graph/graph.js:60:23
 
     for (const [neighbor, weight] of graph[node] || []) {
       if (weight < 0) throw new Error("Negative weights not allowed");
-      const newDist = dist + weight;
+      const newDist = dist - weight;
       if (distances[neighbor] === undefined || newDist < distances[neighbor]) {
         distances[neighbor] = newDist;
killedBy: Dijkstra simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
    "0": 0,
-   "1": 3,

[Killed] ConditionalExpression
algorithms/graph/graph.js:61:48
     for (const [neighbor, weight] of graph[node] || []) {
       if (weight < 0) throw new Error("Negative weights not allowed");
       const newDist = dist + weight;
-      if (distances[neighbor] === undefined || newDist < distances[neighbor]) {
+      if (distances[neighbor] === undefined || false) {
         distances[neighbor] = newDist;
         pq.push([neighbor, newDist]);
killedBy: Dijkstra simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "0": 0,
-   "1": 3,

[Killed] LogicalOperator
algorithms/graph/graph.js:61:11
     for (const [neighbor, weight] of graph[node] || []) {
       if (weight < 0) throw new Error("Negative weights not allowed");
       const newDist = dist + weight;
-      if (distances[neighbor] === undefined || newDist < distances[neighbor]) {
+      if (distances[neighbor] === undefined && newDist < distances[neighbor]) {
         distances[neighbor] = newDist;
         pq.push([neighbor, newDist]);
killedBy: Dijkstra simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
    "0": 0,
-   "1": 3,

[Killed] EqualityOperator
algorithms/graph/graph.js:72:7
 }
 
 function kruskal(numNodes, edges) {
-  if (edges.length === 0) return 0;
+  if (edges.length !== 0) return 0;
 
   edges.sort((a, b) => a[2] - b[2]);
killedBy: Kruskal simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: 0

[Killed] ConditionalExpression
algorithms/graph/graph.js:72:7
 }
 
 function kruskal(numNodes, edges) {
-  if (edges.length === 0) return 0;
+  if (false) return 0;
 
   edges.sort((a, b) => a[2] - b[2]);
killedBy: Kruskal edges empty returns 0
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Killed] MethodExpression
algorithms/graph/graph.js:74:3
 function kruskal(numNodes, edges) {
   if (edges.length === 0) return 0;
 
-  edges.sort((a, b) => a[2] - b[2]);
+  edges;
 
   const parent = Array.from({ length: numNodes }, (_, i) => i);
killedBy: Kruskal simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: 8

[Killed] ArithmeticOperator
algorithms/graph/graph.js:74:24
 function kruskal(numNodes, edges) {
   if (edges.length === 0) return 0;
 
-  edges.sort((a, b) => a[2] - b[2]);
+  edges.sort((a, b) => a[2] + b[2]);
 
   const parent = Array.from({ length: numNodes }, (_, i) => i);
killedBy: Kruskal simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: 8

[Killed] ArrowFunction
algorithms/graph/graph.js:76:51
 
   edges.sort((a, b) => a[2] - b[2]);
 
-  const parent = Array.from({ length: numNodes }, (_, i) => i);
+  const parent = Array.from({ length: numNodes }, () => undefined);
   const rank = Array(numNodes).fill(0);
 
killedBy: Kruskal simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] BlockStatement
algorithms/graph/graph.js:79:20
   const parent = Array.from({ length: numNodes }, (_, i) => i);
   const rank = Array(numNodes).fill(0);
 
-  function find(x) {
-    if (parent[x] !== x) parent[x] = find(parent[x]);
-    return parent[x];
-  }
+  function find(x) {}
 
   function union(x, y) {
killedBy: Kruskal simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] EqualityOperator
algorithms/graph/graph.js:80:9
   const rank = Array(numNodes).fill(0);
 
   function find(x) {
-    if (parent[x] !== x) parent[x] = find(parent[x]);
+    if (parent[x] === x) parent[x] = find(parent[x]);
     return parent[x];
   }
killedBy: Kruskal simple MST
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ConditionalExpression
algorithms/graph/graph.js:80:9
   const rank = Array(numNodes).fill(0);
 
   function find(x) {
-    if (parent[x] !== x) parent[x] = find(parent[x]);
+    if (true) parent[x] = find(parent[x]);
     return parent[x];
   }
killedBy: Kruskal simple MST
statusReason: RangeError: Maximum call stack size exceeded

[Killed] BlockStatement
algorithms/graph/graph.js:84:24
     return parent[x];
   }
 
-  function union(x, y) {
-    const rootX = find(x);
-    const rootY = find(y);
-    if (rootX !== rootY) {
-      if (rank[rootX] > rank[rootY]) parent[rootY] = rootX;
-      else if (rank[rootX] < rank[rootY]) parent[rootX] = rootY;
-      else {
-        parent[rootY] = rootX;
-        rank[rootX]++;
-      }
-    }
-  }
+  function union(x, y) {}
 
   let mstWeight = 0;
killedBy: Kruskal simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] EqualityOperator
algorithms/graph/graph.js:87:9
   function union(x, y) {
     const rootX = find(x);
     const rootY = find(y);
-    if (rootX !== rootY) {
+    if (rootX === rootY) {
       if (rank[rootX] > rank[rootY]) parent[rootY] = rootX;
       else if (rank[rootX] < rank[rootY]) parent[rootX] = rootY;
killedBy: Kruskal simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] ConditionalExpression
algorithms/graph/graph.js:87:9
   function union(x, y) {
     const rootX = find(x);
     const rootY = find(y);
-    if (rootX !== rootY) {
+    if (false) {
       if (rank[rootX] > rank[rootY]) parent[rootY] = rootX;
       else if (rank[rootX] < rank[rootY]) parent[rootX] = rootY;
killedBy: Kruskal simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Survived] EqualityOperator
algorithms/graph/graph.js:88:11
     const rootX = find(x);
     const rootY = find(y);
     if (rootX !== rootY) {
-      if (rank[rootX] > rank[rootY]) parent[rootY] = rootX;
+      if (rank[rootX] >= rank[rootY]) parent[rootY] = rootX;
       else if (rank[rootX] < rank[rootY]) parent[rootX] = rootY;
       else {

[Survived] EqualityOperator
algorithms/graph/graph.js:88:11
     const rootX = find(x);
     const rootY = find(y);
     if (rootX !== rootY) {
-      if (rank[rootX] > rank[rootY]) parent[rootY] = rootX;
+      if (rank[rootX] <= rank[rootY]) parent[rootY] = rootX;
       else if (rank[rootX] < rank[rootY]) parent[rootX] = rootY;
       else {

[Survived] ConditionalExpression
algorithms/graph/graph.js:89:16
     const rootY = find(y);
     if (rootX !== rootY) {
       if (rank[rootX] > rank[rootY]) parent[rootY] = rootX;
-      else if (rank[rootX] < rank[rootY]) parent[rootX] = rootY;
+      else if (false) parent[rootX] = rootY;
       else {
         parent[rootY] = rootX;

[Survived] ConditionalExpression
algorithms/graph/graph.js:89:16
     const rootY = find(y);
     if (rootX !== rootY) {
       if (rank[rootX] > rank[rootY]) parent[rootY] = rootX;
-      else if (rank[rootX] < rank[rootY]) parent[rootX] = rootY;
+      else if (true) parent[rootX] = rootY;
       else {
         parent[rootY] = rootX;

[Killed] BlockStatement
algorithms/graph/graph.js:90:12
     if (rootX !== rootY) {
       if (rank[rootX] > rank[rootY]) parent[rootY] = rootX;
       else if (rank[rootX] < rank[rootY]) parent[rootX] = rootY;
-      else {
-        parent[rootY] = rootX;
-        rank[rootX]++;
-      }
+      else {}
     }
   }
killedBy: Kruskal simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Survived] UpdateOperator
algorithms/graph/graph.js:92:9
       else if (rank[rootX] < rank[rootY]) parent[rootX] = rootY;
       else {
         parent[rootY] = rootX;
-        rank[rootX]++;
+        rank[rootX]--;
       }
     }

[Killed] BlockStatement
algorithms/graph/graph.js:100:34
   let mstWeight = 0;
   let edgesCount = 0;
 
-  for (const [u, v, w] of edges) {
-    if (find(u) !== find(v)) {
-      union(u, v);
-      mstWeight += w;
-      edgesCount++;
-    }
-  }
+  for (const [u, v, w] of edges) {}
 
   return edgesCount === numNodes - 1 ? mstWeight : -1;
killedBy: Kruskal simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] BlockStatement
algorithms/graph/graph.js:101:30
   let edgesCount = 0;
 
   for (const [u, v, w] of edges) {
-    if (find(u) !== find(v)) {
-      union(u, v);
-      mstWeight += w;
-      edgesCount++;
-    }
+    if (find(u) !== find(v)) {}
   }
 
killedBy: Kruskal simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] EqualityOperator
algorithms/graph/graph.js:101:9
   let edgesCount = 0;
 
   for (const [u, v, w] of edges) {
-    if (find(u) !== find(v)) {
+    if (find(u) === find(v)) {
       union(u, v);
       mstWeight += w;
killedBy: Kruskal simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] AssignmentOperator
algorithms/graph/graph.js:103:7
   for (const [u, v, w] of edges) {
     if (find(u) !== find(v)) {
       union(u, v);
-      mstWeight += w;
+      mstWeight -= w;
       edgesCount++;
     }
killedBy: Kruskal simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -6

[Killed] UpdateOperator
algorithms/graph/graph.js:104:7
     if (find(u) !== find(v)) {
       union(u, v);
       mstWeight += w;
-      edgesCount++;
+      edgesCount--;
     }
   }
killedBy: Kruskal simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] ArithmeticOperator
algorithms/graph/graph.js:108:25
     }
   }
 
-  return edgesCount === numNodes - 1 ? mstWeight : -1;
+  return edgesCount === numNodes + 1 ? mstWeight : -1;
 }
 function prim(numNodes, edges) {
killedBy: Kruskal simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] EqualityOperator
algorithms/graph/graph.js:108:10
     }
   }
 
-  return edgesCount === numNodes - 1 ? mstWeight : -1;
+  return edgesCount !== numNodes - 1 ? mstWeight : -1;
 }
 function prim(numNodes, edges) {
killedBy: Kruskal simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] ConditionalExpression
algorithms/graph/graph.js:111:7
   return edgesCount === numNodes - 1 ? mstWeight : -1;
 }
 function prim(numNodes, edges) {
-  if (edges.length === 0) return -1;
+  if (true) return -1;
 
   const graph = {};
killedBy: Prim simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] EqualityOperator
algorithms/graph/graph.js:111:7
   return edgesCount === numNodes - 1 ? mstWeight : -1;
 }
 function prim(numNodes, edges) {
-  if (edges.length === 0) return -1;
+  if (edges.length !== 0) return -1;
 
   const graph = {};
killedBy: Prim simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] BlockStatement
algorithms/graph/graph.js:114:34
   if (edges.length === 0) return -1;
 
   const graph = {};
-  for (const [u, v, w] of edges) {
-    if (!(u in graph)) graph[u] = [];
-    if (!(v in graph)) graph[v] = [];
-    graph[u].push([v, w]);
-    graph[v].push([u, w]);
-  }
+  for (const [u, v, w] of edges) {}
 
   const inMST = Array(numNodes).fill(false);
killedBy: Prim simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] ConditionalExpression
algorithms/graph/graph.js:115:9
 
   const graph = {};
   for (const [u, v, w] of edges) {
-    if (!(u in graph)) graph[u] = [];
+    if (true) graph[u] = [];
     if (!(v in graph)) graph[v] = [];
     graph[u].push([v, w]);
killedBy: Prim simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] ConditionalExpression
algorithms/graph/graph.js:115:9
 
   const graph = {};
   for (const [u, v, w] of edges) {
-    if (!(u in graph)) graph[u] = [];
+    if (false) graph[u] = [];
     if (!(v in graph)) graph[v] = [];
     graph[u].push([v, w]);
killedBy: Prim simple MST
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BooleanLiteral
algorithms/graph/graph.js:116:9
   const graph = {};
   for (const [u, v, w] of edges) {
     if (!(u in graph)) graph[u] = [];
-    if (!(v in graph)) graph[v] = [];
+    if (v in graph) graph[v] = [];
     graph[u].push([v, w]);
     graph[v].push([u, w]);
killedBy: Prim simple MST
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
algorithms/graph/graph.js:116:9
   const graph = {};
   for (const [u, v, w] of edges) {
     if (!(u in graph)) graph[u] = [];
-    if (!(v in graph)) graph[v] = [];
+    if (false) graph[v] = [];
     graph[u].push([v, w]);
     graph[v].push([u, w]);
killedBy: Prim simple MST
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ArrayDeclaration
algorithms/graph/graph.js:117:19
   for (const [u, v, w] of edges) {
     if (!(u in graph)) graph[u] = [];
     if (!(v in graph)) graph[v] = [];
-    graph[u].push([v, w]);
+    graph[u].push([]);
     graph[v].push([u, w]);
   }
killedBy: Prim simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] BooleanLiteral
algorithms/graph/graph.js:121:38
     graph[v].push([u, w]);
   }
 
-  const inMST = Array(numNodes).fill(false);
+  const inMST = Array(numNodes).fill(true);
   const pq = [[0, 0]];
   let mstWeight = 0;
killedBy: Prim simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: 0

[Killed] ArrayDeclaration
algorithms/graph/graph.js:122:14
   }
 
   const inMST = Array(numNodes).fill(false);
-  const pq = [[0, 0]];
+  const pq = [];
   let mstWeight = 0;
 
killedBy: Prim simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] ConditionalExpression
algorithms/graph/graph.js:128:9
   while (pq.length > 0) {
     pq.sort((a, b) => a[1] - b[1]);
     const [node, weight] = pq.shift();
-    if (inMST[node]) continue;
+    if (true) continue;
     inMST[node] = true;
     mstWeight += weight;
killedBy: Prim simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] ConditionalExpression
algorithms/graph/graph.js:128:9
   while (pq.length > 0) {
     pq.sort((a, b) => a[1] - b[1]);
     const [node, weight] = pq.shift();
-    if (inMST[node]) continue;
+    if (false) continue;
     inMST[node] = true;
     mstWeight += weight;
killedBy: Prim simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: 10
