[Timeout] BooleanLiteral
algorithms/graph/graph.js:129:19
     pq.sort((a, b) => a[1] - b[1]);
     const [node, weight] = pq.shift();
     if (inMST[node]) continue;
-    inMST[node] = true;
+    inMST[node] = false;
     mstWeight += weight;
 

[Killed] AssignmentOperator
algorithms/graph/graph.js:130:5
     const [node, weight] = pq.shift();
     if (inMST[node]) continue;
     inMST[node] = true;
-    mstWeight += weight;
+    mstWeight -= weight;
 
     for (const [neighbor, w] of graph[node] || []) {
killedBy: Prim simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -6

[Killed] ConditionalExpression
algorithms/graph/graph.js:132:33
     inMST[node] = true;
     mstWeight += weight;
 
-    for (const [neighbor, w] of graph[node] || []) {
+    for (const [neighbor, w] of true) {
       if (!inMST[neighbor]) pq.push([neighbor, w]);
     }
killedBy: Prim simple MST
statusReason: TypeError: boolean true is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
algorithms/graph/graph.js:132:33
     inMST[node] = true;
     mstWeight += weight;
 
-    for (const [neighbor, w] of graph[node] || []) {
+    for (const [neighbor, w] of false) {
       if (!inMST[neighbor]) pq.push([neighbor, w]);
     }
killedBy: Prim simple MST
statusReason: TypeError: boolean false is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
algorithms/graph/graph.js:133:11
     mstWeight += weight;
 
     for (const [neighbor, w] of graph[node] || []) {
-      if (!inMST[neighbor]) pq.push([neighbor, w]);
+      if (false) pq.push([neighbor, w]);
     }
   }
killedBy: Prim simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] BooleanLiteral
algorithms/graph/graph.js:133:11
     mstWeight += weight;
 
     for (const [neighbor, w] of graph[node] || []) {
-      if (!inMST[neighbor]) pq.push([neighbor, w]);
+      if (inMST[neighbor]) pq.push([neighbor, w]);
     }
   }
killedBy: Prim simple MST
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: -1

[Killed] MethodExpression
algorithms/graph/graph.js:137:10
     }
   }
 
-  return inMST.every(Boolean) ? mstWeight : -1;
+  return inMST.some(Boolean) ? mstWeight : -1;
 }
 function floydWarshall(graph) {
killedBy: Prim graph disconnected returns -1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -1
Received: 1

[Killed] UnaryOperator
algorithms/graph/graph.js:137:45
     }
   }
 
-  return inMST.every(Boolean) ? mstWeight : -1;
+  return inMST.every(Boolean) ? mstWeight : +1;
 }
 function floydWarshall(graph) {
killedBy: Prim graph disconnected returns -1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -1
Received: 1

[Killed] BlockStatement
algorithms/graph/graph.js:139:31
 
   return inMST.every(Boolean) ? mstWeight : -1;
 }
-function floydWarshall(graph) {
-  const n = graph.length;
-  const dist = Array.from({ length: n }, (_, i) =>
-    Array.from({ length: n }, (_, j) =>
-      i === j ? 0 : graph[i][j] !== undefined ? graph[i][j] : Infinity
-    )
-  );
-
-  for (let k = 0; k < n; k++) {
-    for (let i = 0; i < n; i++) {
-      for (let j = 0; j < n; j++) {
-        if (dist[i][k] !== Infinity && dist[k][j] !== Infinity) {
-          dist[i][j] = Math.min(dist[i][j], dist[i][k] + dist[k][j]);
-        }
-      }
-    }
-  }
-
-  for (let i = 0; i < n; i++) {
-    if (dist[i][i] < 0) throw new Error("Negative cycle detected");
-  }
-
-  return dist;
-}
+function floydWarshall(graph) {}
 
 module.exports = {
killedBy: Floyd-Warshall simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [[0, 3, 5, 6], [5, 0, 2, 3], [3, 6, 0, 1], [2, 5, 7, 0]]
Received: undefined

[Killed] ArrowFunction
algorithms/graph/graph.js:141:42
 }
 function floydWarshall(graph) {
   const n = graph.length;
-  const dist = Array.from({ length: n }, (_, i) =>
-    Array.from({ length: n }, (_, j) =>
-      i === j ? 0 : graph[i][j] !== undefined ? graph[i][j] : Infinity
-    )
+  const dist = Array.from({ length: n }, () => undefined
   );
 
killedBy: Floyd-Warshall simple weighted graph
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ArrowFunction
algorithms/graph/graph.js:142:31
 function floydWarshall(graph) {
   const n = graph.length;
   const dist = Array.from({ length: n }, (_, i) =>
-    Array.from({ length: n }, (_, j) =>
-      i === j ? 0 : graph[i][j] !== undefined ? graph[i][j] : Infinity
+    Array.from({ length: n }, () => undefined
     )
   );
killedBy: Floyd-Warshall simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 16
+ Received  + 16

  Array [
    Array [
-     0,

[Killed] EqualityOperator
algorithms/graph/graph.js:143:21
   const n = graph.length;
   const dist = Array.from({ length: n }, (_, i) =>
     Array.from({ length: n }, (_, j) =>
-      i === j ? 0 : graph[i][j] !== undefined ? graph[i][j] : Infinity
+      i === j ? 0 : graph[i][j] === undefined ? graph[i][j] : Infinity
     )
   );
killedBy: Floyd-Warshall simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  + 12

  Array [
    Array [
      0,

[Killed] EqualityOperator
algorithms/graph/graph.js:143:7
   const n = graph.length;
   const dist = Array.from({ length: n }, (_, i) =>
     Array.from({ length: n }, (_, j) =>
-      i === j ? 0 : graph[i][j] !== undefined ? graph[i][j] : Infinity
+      i !== j ? 0 : graph[i][j] !== undefined ? graph[i][j] : Infinity
     )
   );
killedBy: Floyd-Warshall simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  + 12

  Array [
    Array [
      0,

[Killed] EqualityOperator
algorithms/graph/graph.js:147:19
     )
   );
 
-  for (let k = 0; k < n; k++) {
+  for (let k = 0; k <= n; k++) {
     for (let i = 0; i < n; i++) {
       for (let j = 0; j < n; j++) {
killedBy: Floyd-Warshall simple weighted graph
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] UpdateOperator
algorithms/graph/graph.js:147:26
     )
   );
 
-  for (let k = 0; k < n; k++) {
+  for (let k = 0; k < n; k--) {
     for (let i = 0; i < n; i++) {
       for (let j = 0; j < n; j++) {
killedBy: Floyd-Warshall simple weighted graph
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
algorithms/graph/graph.js:148:21
   );
 
   for (let k = 0; k < n; k++) {
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i >= n; i++) {
       for (let j = 0; j < n; j++) {
         if (dist[i][k] !== Infinity && dist[k][j] !== Infinity) {
killedBy: Floyd-Warshall simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 8

  Array [
    Array [
      0,

[Killed] EqualityOperator
algorithms/graph/graph.js:148:21
   );
 
   for (let k = 0; k < n; k++) {
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i <= n; i++) {
       for (let j = 0; j < n; j++) {
         if (dist[i][k] !== Infinity && dist[k][j] !== Infinity) {
killedBy: Floyd-Warshall simple weighted graph
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
algorithms/graph/graph.js:150:13
   for (let k = 0; k < n; k++) {
     for (let i = 0; i < n; i++) {
       for (let j = 0; j < n; j++) {
-        if (dist[i][k] !== Infinity && dist[k][j] !== Infinity) {
+        if (false) {
           dist[i][j] = Math.min(dist[i][j], dist[i][k] + dist[k][j]);
         }
killedBy: Floyd-Warshall simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 8

  Array [
    Array [
      0,

[Killed] BlockStatement
algorithms/graph/graph.js:150:65
   for (let k = 0; k < n; k++) {
     for (let i = 0; i < n; i++) {
       for (let j = 0; j < n; j++) {
-        if (dist[i][k] !== Infinity && dist[k][j] !== Infinity) {
-          dist[i][j] = Math.min(dist[i][j], dist[i][k] + dist[k][j]);
-        }
+        if (dist[i][k] !== Infinity && dist[k][j] !== Infinity) {}
       }
     }
killedBy: Floyd-Warshall simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 8

  Array [
    Array [
      0,

[Killed] ArithmeticOperator
algorithms/graph/graph.js:151:45
     for (let i = 0; i < n; i++) {
       for (let j = 0; j < n; j++) {
         if (dist[i][k] !== Infinity && dist[k][j] !== Infinity) {
-          dist[i][j] = Math.min(dist[i][j], dist[i][k] + dist[k][j]);
+          dist[i][j] = Math.min(dist[i][j], dist[i][k] - dist[k][j]);
         }
       }
killedBy: Floyd-Warshall simple weighted graph
statusReason: Error: Negative cycle detected

[Killed] MethodExpression
algorithms/graph/graph.js:151:24
     for (let i = 0; i < n; i++) {
       for (let j = 0; j < n; j++) {
         if (dist[i][k] !== Infinity && dist[k][j] !== Infinity) {
-          dist[i][j] = Math.min(dist[i][j], dist[i][k] + dist[k][j]);
+          dist[i][j] = Math.max(dist[i][j], dist[i][k] + dist[k][j]);
         }
       }
killedBy: Floyd-Warshall simple weighted graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 15
+ Received  + 15

  Array [
    Array [
-     0,

[Killed] EqualityOperator
algorithms/graph/graph.js:158:9
   }
 
   for (let i = 0; i < n; i++) {
-    if (dist[i][i] < 0) throw new Error("Negative cycle detected");
+    if (dist[i][i] >= 0) throw new Error("Negative cycle detected");
   }
 
killedBy: Floyd-Warshall simple weighted graph
statusReason: Error: Negative cycle detected

[Killed] EqualityOperator
algorithms/graph/graph.js:158:9
   }
 
   for (let i = 0; i < n; i++) {
-    if (dist[i][i] < 0) throw new Error("Negative cycle detected");
+    if (dist[i][i] <= 0) throw new Error("Negative cycle detected");
   }
 
killedBy: Floyd-Warshall simple weighted graph
statusReason: Error: Negative cycle detected

[Killed] ObjectLiteral
algorithms/graph/graph.js:164:18
   return dist;
 }
 
-module.exports = {
-  bfs,
-  dfs,
-  dijkstra,
-  kruskal,
-  prim,
-  floydWarshall,
-};
+module.exports = {};
 
killedBy: BFS simple graph traversal
statusReason: TypeError: bfs is not a function
