[Killed] BlockStatement
algorithms/searching/search.js:1:36
-function linearSearch(arr, target) {
-  for (let i = 0; i < arr.length; i++) {
-    if (arr[i] === target) return i;
-  }
-  return -1;
-}
+function linearSearch(arr, target) {}
 function binarySearch(arr, target) {
   let left = 0;
killedBy: Search Algorithms linearSearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ConditionalExpression
algorithms/searching/search.js:2:19
 function linearSearch(arr, target) {
-  for (let i = 0; i < arr.length; i++) {
+  for (let i = 0; false; i++) {
     if (arr[i] === target) return i;
   }
killedBy: Search Algorithms linearSearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] BlockStatement
algorithms/searching/search.js:2:40
 function linearSearch(arr, target) {
-  for (let i = 0; i < arr.length; i++) {
-    if (arr[i] === target) return i;
-  }
+  for (let i = 0; i < arr.length; i++) {}
   return -1;
 }
killedBy: Search Algorithms linearSearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ConditionalExpression
algorithms/searching/search.js:3:9
 function linearSearch(arr, target) {
   for (let i = 0; i < arr.length; i++) {
-    if (arr[i] === target) return i;
+    if (true) return i;
   }
   return -1;
killedBy: Search Algorithms linearSearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
algorithms/searching/search.js:3:9
 function linearSearch(arr, target) {
   for (let i = 0; i < arr.length; i++) {
-    if (arr[i] === target) return i;
+    if (false) return i;
   }
   return -1;
killedBy: Search Algorithms linearSearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] BlockStatement
algorithms/searching/search.js:7:36
   }
   return -1;
 }
-function binarySearch(arr, target) {
-  let left = 0;
-  let right = arr.length - 1;
-
-  while (left <= right) {
-    const mid = Math.floor((left + right) / 2);
-    if (arr[mid] === target) return mid;
-    else if (arr[mid] < target) left = mid + 1;
-    else right = mid - 1;
-  }
-  return -1;
-}
+function binarySearch(arr, target) {}
 function ternarySearch(arr, target, left = 0, right = arr.length - 1) {
   if (left > right) return -1;
killedBy: Search Algorithms binarySearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ConditionalExpression
algorithms/searching/search.js:11:10
   let left = 0;
   let right = arr.length - 1;
 
-  while (left <= right) {
+  while (false) {
     const mid = Math.floor((left + right) / 2);
     if (arr[mid] === target) return mid;
killedBy: Search Algorithms binarySearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ConditionalExpression
algorithms/searching/search.js:13:9
 
   while (left <= right) {
     const mid = Math.floor((left + right) / 2);
-    if (arr[mid] === target) return mid;
+    if (false) return mid;
     else if (arr[mid] < target) left = mid + 1;
     else right = mid - 1;
killedBy: Search Algorithms binarySearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] EqualityOperator
algorithms/searching/search.js:13:9
 
   while (left <= right) {
     const mid = Math.floor((left + right) / 2);
-    if (arr[mid] === target) return mid;
+    if (arr[mid] !== target) return mid;
     else if (arr[mid] < target) left = mid + 1;
     else right = mid - 1;
killedBy: Search Algorithms binarySearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
algorithms/searching/search.js:14:14
   while (left <= right) {
     const mid = Math.floor((left + right) / 2);
     if (arr[mid] === target) return mid;
-    else if (arr[mid] < target) left = mid + 1;
+    else if (false) left = mid + 1;
     else right = mid - 1;
   }
killedBy: Search Algorithms binarySearch should find last element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -1

[Killed] ConditionalExpression
algorithms/searching/search.js:14:14
   while (left <= right) {
     const mid = Math.floor((left + right) / 2);
     if (arr[mid] === target) return mid;
-    else if (arr[mid] < target) left = mid + 1;
+    else if (true) left = mid + 1;
     else right = mid - 1;
   }
killedBy: Search Algorithms binarySearch should find first element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -1

[Timeout] ArithmeticOperator
algorithms/searching/search.js:15:18
     const mid = Math.floor((left + right) / 2);
     if (arr[mid] === target) return mid;
     else if (arr[mid] < target) left = mid + 1;
-    else right = mid - 1;
+    else right = mid + 1;
   }
   return -1;

[Killed] BlockStatement
algorithms/searching/search.js:19:71
   }
   return -1;
 }
-function ternarySearch(arr, target, left = 0, right = arr.length - 1) {
-  if (left > right) return -1;
-
-  const third = Math.floor((right - left) / 3);
-  const mid1 = left + third;
-  const mid2 = right - third;
-
-  if (arr[mid1] === target) return mid1;
-  if (arr[mid2] === target) return mid2;
-
-  if (target < arr[mid1]) return ternarySearch(arr, target, left, mid1 - 1);
-  else if (target > arr[mid2])
-    return ternarySearch(arr, target, mid2 + 1, right);
-  else return ternarySearch(arr, target, mid1 + 1, mid2 - 1);
-}
+function ternarySearch(arr, target, left = 0, right = arr.length - 1) {}
 
 module.exports = {
killedBy: Search Algorithms ternarySearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Survived] ArithmeticOperator
algorithms/searching/search.js:19:55
   }
   return -1;
 }
-function ternarySearch(arr, target, left = 0, right = arr.length - 1) {
+function ternarySearch(arr, target, left = 0, right = arr.length + 1) {
   if (left > right) return -1;
 

[Killed] EqualityOperator
algorithms/searching/search.js:20:7
   return -1;
 }
 function ternarySearch(arr, target, left = 0, right = arr.length - 1) {
-  if (left > right) return -1;
+  if (left <= right) return -1;
 
   const third = Math.floor((right - left) / 3);
killedBy: Search Algorithms ternarySearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] EqualityOperator
algorithms/searching/search.js:20:7
   return -1;
 }
 function ternarySearch(arr, target, left = 0, right = arr.length - 1) {
-  if (left > right) return -1;
+  if (left >= right) return -1;
 
   const third = Math.floor((right - left) / 3);
killedBy: Search Algorithms ternarySearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ArithmeticOperator
algorithms/searching/search.js:22:29
 function ternarySearch(arr, target, left = 0, right = arr.length - 1) {
   if (left > right) return -1;
 
-  const third = Math.floor((right - left) / 3);
+  const third = Math.floor((right + left) / 3);
   const mid1 = left + third;
   const mid2 = right - third;
killedBy: Search Algorithms ternarySearch should find element in middle
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ArithmeticOperator
algorithms/searching/search.js:22:28
 function ternarySearch(arr, target, left = 0, right = arr.length - 1) {
   if (left > right) return -1;
 
-  const third = Math.floor((right - left) / 3);
+  const third = Math.floor((right - left) * 3);
   const mid1 = left + third;
   const mid2 = right - third;
killedBy: Search Algorithms ternarySearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Survived] ArithmeticOperator
algorithms/searching/search.js:23:16
   if (left > right) return -1;
 
   const third = Math.floor((right - left) / 3);
-  const mid1 = left + third;
+  const mid1 = left - third;
   const mid2 = right - third;
 

[Survived] ArithmeticOperator
algorithms/searching/search.js:24:16
 
   const third = Math.floor((right - left) / 3);
   const mid1 = left + third;
-  const mid2 = right - third;
+  const mid2 = right + third;
 
   if (arr[mid1] === target) return mid1;

[Killed] ConditionalExpression
algorithms/searching/search.js:26:7
   const mid1 = left + third;
   const mid2 = right - third;
 
-  if (arr[mid1] === target) return mid1;
+  if (false) return mid1;
   if (arr[mid2] === target) return mid2;
 
killedBy: Search Algorithms ternarySearch should handle negative numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] EqualityOperator
algorithms/searching/search.js:26:7
   const mid1 = left + third;
   const mid2 = right - third;
 
-  if (arr[mid1] === target) return mid1;
+  if (arr[mid1] !== target) return mid1;
   if (arr[mid2] === target) return mid2;
 
killedBy: Search Algorithms ternarySearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
algorithms/searching/search.js:27:7
   const mid2 = right - third;
 
   if (arr[mid1] === target) return mid1;
-  if (arr[mid2] === target) return mid2;
+  if (true) return mid2;
 
   if (target < arr[mid1]) return ternarySearch(arr, target, left, mid1 - 1);
killedBy: Search Algorithms ternarySearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] EqualityOperator
algorithms/searching/search.js:27:7
   const mid2 = right - third;
 
   if (arr[mid1] === target) return mid1;
-  if (arr[mid2] === target) return mid2;
+  if (arr[mid2] !== target) return mid2;
 
   if (target < arr[mid1]) return ternarySearch(arr, target, left, mid1 - 1);
killedBy: Search Algorithms ternarySearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] EqualityOperator
algorithms/searching/search.js:29:7
   if (arr[mid1] === target) return mid1;
   if (arr[mid2] === target) return mid2;
 
-  if (target < arr[mid1]) return ternarySearch(arr, target, left, mid1 - 1);
+  if (target >= arr[mid1]) return ternarySearch(arr, target, left, mid1 - 1);
   else if (target > arr[mid2])
     return ternarySearch(arr, target, mid2 + 1, right);
killedBy: Search Algorithms ternarySearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ConditionalExpression
algorithms/searching/search.js:29:7
   if (arr[mid1] === target) return mid1;
   if (arr[mid2] === target) return mid2;
 
-  if (target < arr[mid1]) return ternarySearch(arr, target, left, mid1 - 1);
+  if (true) return ternarySearch(arr, target, left, mid1 - 1);
   else if (target > arr[mid2])
     return ternarySearch(arr, target, mid2 + 1, right);
killedBy: Search Algorithms ternarySearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ConditionalExpression
algorithms/searching/search.js:30:12
   if (arr[mid2] === target) return mid2;
 
   if (target < arr[mid1]) return ternarySearch(arr, target, left, mid1 - 1);
-  else if (target > arr[mid2])
+  else if (true)
     return ternarySearch(arr, target, mid2 + 1, right);
   else return ternarySearch(arr, target, mid1 + 1, mid2 - 1);
killedBy: Search Algorithms ternarySearch should find element in middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ConditionalExpression
algorithms/searching/search.js:30:12
   if (arr[mid2] === target) return mid2;
 
   if (target < arr[mid1]) return ternarySearch(arr, target, left, mid1 - 1);
-  else if (target > arr[mid2])
+  else if (false)
     return ternarySearch(arr, target, mid2 + 1, right);
   else return ternarySearch(arr, target, mid1 + 1, mid2 - 1);
killedBy: Search Algorithms ternarySearch should find last element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -1

[Killed] ArithmeticOperator
algorithms/searching/search.js:31:39
 
   if (target < arr[mid1]) return ternarySearch(arr, target, left, mid1 - 1);
   else if (target > arr[mid2])
-    return ternarySearch(arr, target, mid2 + 1, right);
+    return ternarySearch(arr, target, mid2 - 1, right);
   else return ternarySearch(arr, target, mid1 + 1, mid2 - 1);
 }
killedBy: Search Algorithms ternarySearch should return -1 if element not found
statusReason: RangeError: Maximum call stack size exceeded

[Survived] ArithmeticOperator
algorithms/searching/search.js:32:52
   if (target < arr[mid1]) return ternarySearch(arr, target, left, mid1 - 1);
   else if (target > arr[mid2])
     return ternarySearch(arr, target, mid2 + 1, right);
-  else return ternarySearch(arr, target, mid1 + 1, mid2 - 1);
+  else return ternarySearch(arr, target, mid1 + 1, mid2 + 1);
 }
 

[Survived] ArithmeticOperator
algorithms/searching/search.js:32:42
   if (target < arr[mid1]) return ternarySearch(arr, target, left, mid1 - 1);
   else if (target > arr[mid2])
     return ternarySearch(arr, target, mid2 + 1, right);
-  else return ternarySearch(arr, target, mid1 + 1, mid2 - 1);
+  else return ternarySearch(arr, target, mid1 - 1, mid2 - 1);
 }
 
