[Killed] BlockStatement
algorithms/sorting/sort.js:1:26
-function bubbleSort(arr) {
-  const n = arr.length;
-  const result = [...arr];
-  for (let i = 0; i < n - 1; i++) {
-    for (let j = 0; j < n - i - 1; j++) {
-      if (result[j] > result[j + 1]) {
-        const temp = result[j];
-        result[j] = result[j + 1];
-        result[j + 1] = temp;
-      }
-    }
-  }
-  return result;
-}
+function bubbleSort(arr) {}
 function selectionSort(arr) {
   const n = arr.length;
killedBy: Bubble Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 5, 5, 6, 9]
Received: undefined

[Killed] ConditionalExpression
algorithms/sorting/sort.js:4:19
 function bubbleSort(arr) {
   const n = arr.length;
   const result = [...arr];
-  for (let i = 0; i < n - 1; i++) {
+  for (let i = 0; false; i++) {
     for (let j = 0; j < n - i - 1; j++) {
       if (result[j] > result[j + 1]) {
killedBy: Bubble Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] BlockStatement
algorithms/sorting/sort.js:4:35
 function bubbleSort(arr) {
   const n = arr.length;
   const result = [...arr];
-  for (let i = 0; i < n - 1; i++) {
-    for (let j = 0; j < n - i - 1; j++) {
-      if (result[j] > result[j + 1]) {
-        const temp = result[j];
-        result[j] = result[j + 1];
-        result[j + 1] = temp;
-      }
-    }
-  }
+  for (let i = 0; i < n - 1; i++) {}
   return result;
 }
killedBy: Bubble Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
algorithms/sorting/sort.js:5:21
   const n = arr.length;
   const result = [...arr];
   for (let i = 0; i < n - 1; i++) {
-    for (let j = 0; j < n - i - 1; j++) {
+    for (let j = 0; false; j++) {
       if (result[j] > result[j + 1]) {
         const temp = result[j];
killedBy: Bubble Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] BlockStatement
algorithms/sorting/sort.js:5:41
   const n = arr.length;
   const result = [...arr];
   for (let i = 0; i < n - 1; i++) {
-    for (let j = 0; j < n - i - 1; j++) {
-      if (result[j] > result[j + 1]) {
-        const temp = result[j];
-        result[j] = result[j + 1];
-        result[j + 1] = temp;
-      }
-    }
+    for (let j = 0; j < n - i - 1; j++) {}
   }
   return result;
killedBy: Bubble Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
algorithms/sorting/sort.js:6:11
   const result = [...arr];
   for (let i = 0; i < n - 1; i++) {
     for (let j = 0; j < n - i - 1; j++) {
-      if (result[j] > result[j + 1]) {
+      if (false) {
         const temp = result[j];
         result[j] = result[j + 1];
killedBy: Bubble Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
algorithms/sorting/sort.js:6:11
   const result = [...arr];
   for (let i = 0; i < n - 1; i++) {
     for (let j = 0; j < n - i - 1; j++) {
-      if (result[j] > result[j + 1]) {
+      if (true) {
         const temp = result[j];
         result[j] = result[j + 1];
killedBy: Bubble Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
+   6,
+   5,

[Killed] ArithmeticOperator
algorithms/sorting/sort.js:8:28
     for (let j = 0; j < n - i - 1; j++) {
       if (result[j] > result[j + 1]) {
         const temp = result[j];
-        result[j] = result[j + 1];
+        result[j] = result[j - 1];
         result[j + 1] = temp;
       }
killedBy: Bubble Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ArithmeticOperator
algorithms/sorting/sort.js:9:16
       if (result[j] > result[j + 1]) {
         const temp = result[j];
         result[j] = result[j + 1];
-        result[j + 1] = temp;
+        result[j - 1] = temp;
       }
     }
killedBy: Bubble Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    1,
-   2,

[Killed] BlockStatement
algorithms/sorting/sort.js:15:29
   }
   return result;
 }
-function selectionSort(arr) {
-  const n = arr.length;
-  const result = [...arr];
-  for (let i = 0; i < n - 1; i++) {
-    let minIndex = i;
-    for (let j = i + 1; j < n; j++) {
-      if (result[j] < result[minIndex]) minIndex = j;
-    }
-    if (minIndex !== i) {
-      const temp = result[i];
-      result[i] = result[minIndex];
-      result[minIndex] = temp;
-    }
-  }
-  return result;
-}
+function selectionSort(arr) {}
 function mergeSort(arr) {
   if (arr.length <= 1) return [...arr];
killedBy: Selection Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 5, 5, 6, 9]
Received: undefined

[Killed] ArrayDeclaration
algorithms/sorting/sort.js:17:18
 }
 function selectionSort(arr) {
   const n = arr.length;
-  const result = [...arr];
+  const result = [];
   for (let i = 0; i < n - 1; i++) {
     let minIndex = i;
killedBy: Selection Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   1,
-   2,

[Killed] BlockStatement
algorithms/sorting/sort.js:18:35
 function selectionSort(arr) {
   const n = arr.length;
   const result = [...arr];
-  for (let i = 0; i < n - 1; i++) {
-    let minIndex = i;
-    for (let j = i + 1; j < n; j++) {
-      if (result[j] < result[minIndex]) minIndex = j;
-    }
-    if (minIndex !== i) {
-      const temp = result[i];
-      result[i] = result[minIndex];
-      result[minIndex] = temp;
-    }
-  }
+  for (let i = 0; i < n - 1; i++) {}
   return result;
 }
killedBy: Selection Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
algorithms/sorting/sort.js:20:25
   const result = [...arr];
   for (let i = 0; i < n - 1; i++) {
     let minIndex = i;
-    for (let j = i + 1; j < n; j++) {
+    for (let j = i + 1; false; j++) {
       if (result[j] < result[minIndex]) minIndex = j;
     }
killedBy: Selection Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] BlockStatement
algorithms/sorting/sort.js:20:37
   const result = [...arr];
   for (let i = 0; i < n - 1; i++) {
     let minIndex = i;
-    for (let j = i + 1; j < n; j++) {
-      if (result[j] < result[minIndex]) minIndex = j;
-    }
+    for (let j = i + 1; j < n; j++) {}
     if (minIndex !== i) {
       const temp = result[i];
killedBy: Selection Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
algorithms/sorting/sort.js:21:11
   for (let i = 0; i < n - 1; i++) {
     let minIndex = i;
     for (let j = i + 1; j < n; j++) {
-      if (result[j] < result[minIndex]) minIndex = j;
+      if (false) minIndex = j;
     }
     if (minIndex !== i) {
killedBy: Selection Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
algorithms/sorting/sort.js:21:11
   for (let i = 0; i < n - 1; i++) {
     let minIndex = i;
     for (let j = i + 1; j < n; j++) {
-      if (result[j] < result[minIndex]) minIndex = j;
+      if (true) minIndex = j;
     }
     if (minIndex !== i) {
killedBy: Selection Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   1,
-   2,

[Killed] BlockStatement
algorithms/sorting/sort.js:31:25
   }
   return result;
 }
-function mergeSort(arr) {
-  if (arr.length <= 1) return [...arr];
-
-  const mid = Math.floor(arr.length / 2);
-  const left = mergeSort(arr.slice(0, mid));
-  const right = mergeSort(arr.slice(mid));
-
-  return merge(left, right);
-}
+function mergeSort(arr) {}
 
 function merge(left, right) {
killedBy: Merge Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 5, 5, 6, 9]
Received: undefined

[Killed] EqualityOperator
algorithms/sorting/sort.js:32:7
   return result;
 }
 function mergeSort(arr) {
-  if (arr.length <= 1) return [...arr];
+  if (arr.length > 1) return [...arr];
 
   const mid = Math.floor(arr.length / 2);
killedBy: Merge Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
algorithms/sorting/sort.js:32:7
   return result;
 }
 function mergeSort(arr) {
-  if (arr.length <= 1) return [...arr];
+  if (false) return [...arr];
 
   const mid = Math.floor(arr.length / 2);
killedBy: Merge Sort sorts a normal array
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ArithmeticOperator
algorithms/sorting/sort.js:34:26
 function mergeSort(arr) {
   if (arr.length <= 1) return [...arr];
 
-  const mid = Math.floor(arr.length / 2);
+  const mid = Math.floor(arr.length * 2);
   const left = mergeSort(arr.slice(0, mid));
   const right = mergeSort(arr.slice(mid));
killedBy: Merge Sort sorts a normal array
statusReason: RangeError: Maximum call stack size exceeded

[Killed] MethodExpression
algorithms/sorting/sort.js:35:26
   if (arr.length <= 1) return [...arr];
 
   const mid = Math.floor(arr.length / 2);
-  const left = mergeSort(arr.slice(0, mid));
+  const left = mergeSort(arr);
   const right = mergeSort(arr.slice(mid));
 
killedBy: Merge Sort sorts a normal array
statusReason: RangeError: Maximum call stack size exceeded

[Killed] MethodExpression
algorithms/sorting/sort.js:36:27
 
   const mid = Math.floor(arr.length / 2);
   const left = mergeSort(arr.slice(0, mid));
-  const right = mergeSort(arr.slice(mid));
+  const right = mergeSort(arr);
 
   return merge(left, right);
killedBy: Merge Sort sorts a normal array
statusReason: RangeError: Maximum call stack size exceeded

[Killed] BlockStatement
algorithms/sorting/sort.js:41:29
   return merge(left, right);
 }
 
-function merge(left, right) {
-  const result = [];
-  let i = 0,
-    j = 0;
-
-  while (i < left.length && j < right.length) {
-    if (left[i] <= right[j]) {
-      result.push(left[i++]);
-    } else {
-      result.push(right[j++]);
-    }
-  }
-
-  while (i < left.length) result.push(left[i++]);
-  while (j < right.length) result.push(right[j++]);
-
-  return result;
-}
+function merge(left, right) {}
 function quickSort(arr) {
   if (arr.length <= 1) return [...arr];
killedBy: Merge Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 5, 5, 6, 9]
Received: undefined

[Killed] EqualityOperator
algorithms/sorting/sort.js:46:10
   let i = 0,
     j = 0;
 
-  while (i < left.length && j < right.length) {
+  while (i >= left.length && j < right.length) {
     if (left[i] <= right[j]) {
       result.push(left[i++]);
killedBy: Merge Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] EqualityOperator
algorithms/sorting/sort.js:46:29
   let i = 0,
     j = 0;
 
-  while (i < left.length && j < right.length) {
+  while (i < left.length && j >= right.length) {
     if (left[i] <= right[j]) {
       result.push(left[i++]);
killedBy: Merge Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
algorithms/sorting/sort.js:47:9
     j = 0;
 
   while (i < left.length && j < right.length) {
-    if (left[i] <= right[j]) {
+    if (true) {
       result.push(left[i++]);
     } else {
killedBy: Merge Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] EqualityOperator
algorithms/sorting/sort.js:47:9
     j = 0;
 
   while (i < left.length && j < right.length) {
-    if (left[i] <= right[j]) {
+    if (left[i] > right[j]) {
       result.push(left[i++]);
     } else {
killedBy: Merge Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   1,
-   2,

[Killed] UpdateOperator
algorithms/sorting/sort.js:48:24
 
   while (i < left.length && j < right.length) {
     if (left[i] <= right[j]) {
-      result.push(left[i++]);
+      result.push(left[i--]);
     } else {
       result.push(right[j++]);
killedBy: Merge Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 11

  Array [
    1,
    2,

[Timeout] BlockStatement
algorithms/sorting/sort.js:49:12
   while (i < left.length && j < right.length) {
     if (left[i] <= right[j]) {
       result.push(left[i++]);
-    } else {
-      result.push(right[j++]);
-    }
+    } else {}
   }
 

[Timeout] UpdateOperator
algorithms/sorting/sort.js:50:25
     if (left[i] <= right[j]) {
       result.push(left[i++]);
     } else {
-      result.push(right[j++]);
+      result.push(right[j--]);
     }
   }

[Killed] ConditionalExpression
algorithms/sorting/sort.js:54:10
     }
   }
 
-  while (i < left.length) result.push(left[i++]);
+  while (false) result.push(left[i++]);
   while (j < right.length) result.push(right[j++]);
 
killedBy: Merge Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

@@ -2,7 +2,6 @@
    1,
    2,

[Killed] EqualityOperator
algorithms/sorting/sort.js:54:10
     }
   }
 
-  while (i < left.length) result.push(left[i++]);
+  while (i <= left.length) result.push(left[i++]);
   while (j < right.length) result.push(right[j++]);
 
killedBy: Merge Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

  Array [
    1,
+   undefined,

[Killed] EqualityOperator
algorithms/sorting/sort.js:55:10
   }
 
   while (i < left.length) result.push(left[i++]);
-  while (j < right.length) result.push(right[j++]);
+  while (j <= right.length) result.push(right[j++]);
 
   return result;
killedBy: Merge Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 5

@@ -2,7 +2,12 @@
    1,
    2,

[Killed] ConditionalExpression
algorithms/sorting/sort.js:55:10
   }
 
   while (i < left.length) result.push(left[i++]);
-  while (j < right.length) result.push(right[j++]);
+  while (false) result.push(right[j++]);
 
   return result;
killedBy: Merge Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Array [
    1,
    2,

[Killed] BlockStatement
algorithms/sorting/sort.js:59:25
 
   return result;
 }
-function quickSort(arr) {
-  if (arr.length <= 1) return [...arr];
-
-  const result = [...arr];
-  quickSortHelper(result, 0, result.length - 1);
-  return result;
-}
+function quickSort(arr) {}
 
 function quickSortHelper(arr, low, high) {
killedBy: Quick Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 5, 5, 6, 9]
Received: undefined

[Killed] EqualityOperator
algorithms/sorting/sort.js:60:7
   return result;
 }
 function quickSort(arr) {
-  if (arr.length <= 1) return [...arr];
+  if (arr.length > 1) return [...arr];
 
   const result = [...arr];
killedBy: Quick Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
algorithms/sorting/sort.js:60:7
   return result;
 }
 function quickSort(arr) {
-  if (arr.length <= 1) return [...arr];
+  if (true) return [...arr];
 
   const result = [...arr];
killedBy: Quick Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ArithmeticOperator
algorithms/sorting/sort.js:63:30
   if (arr.length <= 1) return [...arr];
 
   const result = [...arr];
-  quickSortHelper(result, 0, result.length - 1);
+  quickSortHelper(result, 0, result.length + 1);
   return result;
 }
killedBy: Quick Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
+   undefined,
    1,

[Killed] BlockStatement
algorithms/sorting/sort.js:67:42
   return result;
 }
 
-function quickSortHelper(arr, low, high) {
-  if (low < high) {
-    const pi = partition(arr, low, high);
-    quickSortHelper(arr, low, pi - 1);
-    quickSortHelper(arr, pi + 1, high);
-  }
-}
+function quickSortHelper(arr, low, high) {}
 
 function partition(arr, low, high) {
killedBy: Quick Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
algorithms/sorting/sort.js:68:7
 }
 
 function quickSortHelper(arr, low, high) {
-  if (low < high) {
+  if (true) {
     const pi = partition(arr, low, high);
     quickSortHelper(arr, low, pi - 1);
killedBy: Quick Sort sorts a normal array
statusReason: RangeError: Maximum call stack size exceeded

[Killed] BlockStatement
algorithms/sorting/sort.js:68:19
 }
 
 function quickSortHelper(arr, low, high) {
-  if (low < high) {
-    const pi = partition(arr, low, high);
-    quickSortHelper(arr, low, pi - 1);
-    quickSortHelper(arr, pi + 1, high);
-  }
+  if (low < high) {}
 }
 
killedBy: Quick Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ArithmeticOperator
algorithms/sorting/sort.js:70:31
 function quickSortHelper(arr, low, high) {
   if (low < high) {
     const pi = partition(arr, low, high);
-    quickSortHelper(arr, low, pi - 1);
+    quickSortHelper(arr, low, pi + 1);
     quickSortHelper(arr, pi + 1, high);
   }
killedBy: Quick Sort sorts a normal array
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ArithmeticOperator
algorithms/sorting/sort.js:71:26
   if (low < high) {
     const pi = partition(arr, low, high);
     quickSortHelper(arr, low, pi - 1);
-    quickSortHelper(arr, pi + 1, high);
+    quickSortHelper(arr, pi - 1, high);
   }
 }
killedBy: Quick Sort sorts a normal array
statusReason: RangeError: Maximum call stack size exceeded

[Killed] BlockStatement
algorithms/sorting/sort.js:75:36
   }
 }
 
-function partition(arr, low, high) {
-  const pivot = arr[high];
-  let i = low - 1;
-  for (let j = low; j < high; j++) {
-    if (arr[j] <= pivot) {
-      i++;
-      const temp = arr[i];
-      arr[i] = arr[j];
-      arr[j] = temp;
-    }
-  }
-  const temp = arr[i + 1];
-  arr[i + 1] = arr[high];
-  arr[high] = temp;
-  return i + 1;
-}
+function partition(arr, low, high) {}
 
 module.exports = {
killedBy: Quick Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ArithmeticOperator
algorithms/sorting/sort.js:77:11
 
 function partition(arr, low, high) {
   const pivot = arr[high];
-  let i = low - 1;
+  let i = low + 1;
   for (let j = low; j < high; j++) {
     if (arr[j] <= pivot) {
killedBy: Quick Sort sorts a normal array
statusReason: RangeError: Maximum call stack size exceeded

[Killed] EqualityOperator
algorithms/sorting/sort.js:78:21
 function partition(arr, low, high) {
   const pivot = arr[high];
   let i = low - 1;
-  for (let j = low; j < high; j++) {
+  for (let j = low; j >= high; j++) {
     if (arr[j] <= pivot) {
       i++;
killedBy: Quick Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   1,
-   2,

[Killed] BlockStatement
algorithms/sorting/sort.js:78:36
 function partition(arr, low, high) {
   const pivot = arr[high];
   let i = low - 1;
-  for (let j = low; j < high; j++) {
-    if (arr[j] <= pivot) {
-      i++;
-      const temp = arr[i];
-      arr[i] = arr[j];
-      arr[j] = temp;
-    }
-  }
+  for (let j = low; j < high; j++) {}
   const temp = arr[i + 1];
   arr[i + 1] = arr[high];
killedBy: Quick Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
algorithms/sorting/sort.js:79:9
   const pivot = arr[high];
   let i = low - 1;
   for (let j = low; j < high; j++) {
-    if (arr[j] <= pivot) {
+    if (false) {
       i++;
       const temp = arr[i];
killedBy: Quick Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
algorithms/sorting/sort.js:79:9
   const pivot = arr[high];
   let i = low - 1;
   for (let j = low; j < high; j++) {
-    if (arr[j] <= pivot) {
+    if (true) {
       i++;
       const temp = arr[i];
killedBy: Quick Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] UpdateOperator
algorithms/sorting/sort.js:80:7
   let i = low - 1;
   for (let j = low; j < high; j++) {
     if (arr[j] <= pivot) {
-      i++;
+      i--;
       const temp = arr[i];
       arr[i] = arr[j];
killedBy: Quick Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   1,
-   2,

[Killed] ArithmeticOperator
algorithms/sorting/sort.js:86:20
       arr[j] = temp;
     }
   }
-  const temp = arr[i + 1];
+  const temp = arr[i - 1];
   arr[i + 1] = arr[high];
   arr[high] = temp;
killedBy: Quick Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    1,
+   undefined,

[Killed] ArithmeticOperator
algorithms/sorting/sort.js:87:7
     }
   }
   const temp = arr[i + 1];
-  arr[i + 1] = arr[high];
+  arr[i - 1] = arr[high];
   arr[high] = temp;
   return i + 1;
killedBy: Quick Sort sorts a normal array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
-   2,

[Timeout] ArithmeticOperator
algorithms/sorting/sort.js:89:10
   const temp = arr[i + 1];
   arr[i + 1] = arr[high];
   arr[high] = temp;
-  return i + 1;
+  return i - 1;
 }
 
