[Killed] BlockStatement
algorithms/strings/string.js:1:45
-function naiveStringMatching(text, pattern) {
-  const result = [];
-  const n = text.length;
-  const m = pattern.length;
-
-  for (let i = 0; i <= n - m; i++) {
-    let j;
-    for (j = 0; j < m; j++) {
-      if (text[i + j] !== pattern[j]) break;
-    }
-    if (j === m) result.push(i);
-  }
-
-  return result;
-}
+function naiveStringMatching(text, pattern) {}
 
 function rabinKarp(text, pattern, prime = 101) {
killedBy: String Matching Algorithms naiveStringMatching should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1]
Received: undefined

[Killed] BlockStatement
algorithms/strings/string.js:6:36
   const n = text.length;
   const m = pattern.length;
 
-  for (let i = 0; i <= n - m; i++) {
-    let j;
-    for (j = 0; j < m; j++) {
-      if (text[i + j] !== pattern[j]) break;
-    }
-    if (j === m) result.push(i);
-  }
+  for (let i = 0; i <= n - m; i++) {}
 
   return result;
killedBy: String Matching Algorithms naiveStringMatching should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] EqualityOperator
algorithms/strings/string.js:6:19
   const n = text.length;
   const m = pattern.length;
 
-  for (let i = 0; i <= n - m; i++) {
+  for (let i = 0; i < n - m; i++) {
     let j;
     for (j = 0; j < m; j++) {
killedBy: String Matching Algorithms naiveStringMatching should find multiple matches
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    0,
    1,

[Killed] BlockStatement
algorithms/strings/string.js:8:29
 
   for (let i = 0; i <= n - m; i++) {
     let j;
-    for (j = 0; j < m; j++) {
-      if (text[i + j] !== pattern[j]) break;
-    }
+    for (j = 0; j < m; j++) {}
     if (j === m) result.push(i);
   }
killedBy: String Matching Algorithms naiveStringMatching should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
+   0,
    1,

[Killed] EqualityOperator
algorithms/strings/string.js:8:17
 
   for (let i = 0; i <= n - m; i++) {
     let j;
-    for (j = 0; j < m; j++) {
+    for (j = 0; j <= m; j++) {
       if (text[i + j] !== pattern[j]) break;
     }
killedBy: String Matching Algorithms naiveStringMatching should find multiple matches
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    0,
    1,

[Killed] ConditionalExpression
algorithms/strings/string.js:9:11
   for (let i = 0; i <= n - m; i++) {
     let j;
     for (j = 0; j < m; j++) {
-      if (text[i + j] !== pattern[j]) break;
+      if (false) break;
     }
     if (j === m) result.push(i);
killedBy: String Matching Algorithms naiveStringMatching should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
+   0,
    1,

[Killed] EqualityOperator
algorithms/strings/string.js:9:11
   for (let i = 0; i <= n - m; i++) {
     let j;
     for (j = 0; j < m; j++) {
-      if (text[i + j] !== pattern[j]) break;
+      if (text[i + j] === pattern[j]) break;
     }
     if (j === m) result.push(i);
killedBy: String Matching Algorithms naiveStringMatching should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ConditionalExpression
algorithms/strings/string.js:11:9
     for (j = 0; j < m; j++) {
       if (text[i + j] !== pattern[j]) break;
     }
-    if (j === m) result.push(i);
+    if (false) result.push(i);
   }
 
killedBy: String Matching Algorithms naiveStringMatching should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ConditionalExpression
algorithms/strings/string.js:11:9
     for (j = 0; j < m; j++) {
       if (text[i + j] !== pattern[j]) break;
     }
-    if (j === m) result.push(i);
+    if (true) result.push(i);
   }
 
killedBy: String Matching Algorithms naiveStringMatching should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
+   0,
    1,

[Killed] BlockStatement
algorithms/strings/string.js:21:17
   const result = [];
   const n = text.length;
   const m = pattern.length;
-   if (m === 0) {
-     for (let i = 0; i <= n; i++) result.push(i);
-     return result;
-   }
+   if (m === 0) {}
   if (m > n) return result;
 
killedBy: String Matching Algorithms rabinKarp should handle empty pattern
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Array [
    0,
-   1,

[Killed] ConditionalExpression
algorithms/strings/string.js:21:8
   const result = [];
   const n = text.length;
   const m = pattern.length;
-   if (m === 0) {
+   if (true) {
      for (let i = 0; i <= n; i++) result.push(i);
      return result;
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 5

  Array [
+   0,
    1,

[Killed] EqualityOperator
algorithms/strings/string.js:22:22
   const n = text.length;
   const m = pattern.length;
    if (m === 0) {
-     for (let i = 0; i <= n; i++) result.push(i);
+     for (let i = 0; i < n; i++) result.push(i);
      return result;
    }
killedBy: String Matching Algorithms rabinKarp should handle empty pattern
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    0,
    1,

[Killed] EqualityOperator
algorithms/strings/string.js:22:22
   const n = text.length;
   const m = pattern.length;
    if (m === 0) {
-     for (let i = 0; i <= n; i++) result.push(i);
+     for (let i = 0; i > n; i++) result.push(i);
      return result;
    }
killedBy: String Matching Algorithms rabinKarp should handle empty pattern
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   0,
-   1,

[Killed] EqualityOperator
algorithms/strings/string.js:25:7
      for (let i = 0; i <= n; i++) result.push(i);
      return result;
    }
-  if (m > n) return result;
+  if (m <= n) return result;
 
   const base = 256;
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ConditionalExpression
algorithms/strings/string.js:25:7
      for (let i = 0; i <= n; i++) result.push(i);
      return result;
    }
-  if (m > n) return result;
+  if (true) return result;
 
   const base = 256;
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] EqualityOperator
algorithms/strings/string.js:32:19
   let textHash = 0;
   let h = 1;
 
-  for (let i = 0; i < m - 1; i++) {
+  for (let i = 0; i <= m - 1; i++) {
     h = (h * base) % prime;
   }
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ArithmeticOperator
algorithms/strings/string.js:32:23
   let textHash = 0;
   let h = 1;
 
-  for (let i = 0; i < m - 1; i++) {
+  for (let i = 0; i < m + 1; i++) {
     h = (h * base) % prime;
   }
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ArithmeticOperator
algorithms/strings/string.js:33:9
   let h = 1;
 
   for (let i = 0; i < m - 1; i++) {
-    h = (h * base) % prime;
+    h = h * base * prime;
   }
 
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ArithmeticOperator
algorithms/strings/string.js:33:10
   let h = 1;
 
   for (let i = 0; i < m - 1; i++) {
-    h = (h * base) % prime;
+    h = (h / base) % prime;
   }
 
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] EqualityOperator
algorithms/strings/string.js:36:19
     h = (h * base) % prime;
   }
 
-  for (let i = 0; i < m; i++) {
+  for (let i = 0; i >= m; i++) {
     patternHash = (base * patternHash + pattern.charCodeAt(i)) % prime;
     textHash = (base * textHash + text.charCodeAt(i)) % prime;
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ArithmeticOperator
algorithms/strings/string.js:37:19
   }
 
   for (let i = 0; i < m; i++) {
-    patternHash = (base * patternHash + pattern.charCodeAt(i)) % prime;
+    patternHash = (base * patternHash + pattern.charCodeAt(i)) * prime;
     textHash = (base * textHash + text.charCodeAt(i)) % prime;
   }
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ArithmeticOperator
algorithms/strings/string.js:37:20
   }
 
   for (let i = 0; i < m; i++) {
-    patternHash = (base * patternHash + pattern.charCodeAt(i)) % prime;
+    patternHash = (base / patternHash + pattern.charCodeAt(i)) % prime;
     textHash = (base * textHash + text.charCodeAt(i)) % prime;
   }
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ArithmeticOperator
algorithms/strings/string.js:38:16
 
   for (let i = 0; i < m; i++) {
     patternHash = (base * patternHash + pattern.charCodeAt(i)) % prime;
-    textHash = (base * textHash + text.charCodeAt(i)) % prime;
+    textHash = (base * textHash + text.charCodeAt(i)) * prime;
   }
 
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ArithmeticOperator
algorithms/strings/string.js:38:17
 
   for (let i = 0; i < m; i++) {
     patternHash = (base * patternHash + pattern.charCodeAt(i)) % prime;
-    textHash = (base * textHash + text.charCodeAt(i)) % prime;
+    textHash = (base / textHash + text.charCodeAt(i)) % prime;
   }
 
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] BlockStatement
algorithms/strings/string.js:41:36
     textHash = (base * textHash + text.charCodeAt(i)) % prime;
   }
 
-  for (let i = 0; i <= n - m; i++) {
-    if (patternHash === textHash) {
-      let match = true;
-      for (let j = 0; j < m; j++) {
-        if (text[i + j] !== pattern[j]) {
-          match = false;
-          break;
-        }
-      }
-      if (match) result.push(i);
-    }
-
-    if (i < n - m) {
-      textHash =
-        (base * (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i + m)) %
-        prime;
-      if (textHash < 0) textHash += prime;
-    }
-  }
+  for (let i = 0; i <= n - m; i++) {}
 
   return result;
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] EqualityOperator
algorithms/strings/string.js:42:9
   }
 
   for (let i = 0; i <= n - m; i++) {
-    if (patternHash === textHash) {
+    if (patternHash !== textHash) {
       let match = true;
       for (let j = 0; j < m; j++) {
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] BlockStatement
algorithms/strings/string.js:42:35
   }
 
   for (let i = 0; i <= n - m; i++) {
-    if (patternHash === textHash) {
-      let match = true;
-      for (let j = 0; j < m; j++) {
-        if (text[i + j] !== pattern[j]) {
-          match = false;
-          break;
-        }
-      }
-      if (match) result.push(i);
-    }
+    if (patternHash === textHash) {}
 
     if (i < n - m) {
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] BooleanLiteral
algorithms/strings/string.js:43:19
 
   for (let i = 0; i <= n - m; i++) {
     if (patternHash === textHash) {
-      let match = true;
+      let match = false;
       for (let j = 0; j < m; j++) {
         if (text[i + j] !== pattern[j]) {
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] EqualityOperator
algorithms/strings/string.js:44:23
   for (let i = 0; i <= n - m; i++) {
     if (patternHash === textHash) {
       let match = true;
-      for (let j = 0; j < m; j++) {
+      for (let j = 0; j <= m; j++) {
         if (text[i + j] !== pattern[j]) {
           match = false;
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Survived] ConditionalExpression
algorithms/strings/string.js:44:23
   for (let i = 0; i <= n - m; i++) {
     if (patternHash === textHash) {
       let match = true;
-      for (let j = 0; j < m; j++) {
+      for (let j = 0; false; j++) {
         if (text[i + j] !== pattern[j]) {
           match = false;

[Killed] ConditionalExpression
algorithms/strings/string.js:45:13
     if (patternHash === textHash) {
       let match = true;
       for (let j = 0; j < m; j++) {
-        if (text[i + j] !== pattern[j]) {
+        if (true) {
           match = false;
           break;
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] EqualityOperator
algorithms/strings/string.js:45:13
     if (patternHash === textHash) {
       let match = true;
       for (let j = 0; j < m; j++) {
-        if (text[i + j] !== pattern[j]) {
+        if (text[i + j] === pattern[j]) {
           match = false;
           break;
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Survived] BooleanLiteral
algorithms/strings/string.js:46:19
       let match = true;
       for (let j = 0; j < m; j++) {
         if (text[i + j] !== pattern[j]) {
-          match = false;
+          match = true;
           break;
         }

[Killed] ConditionalExpression
algorithms/strings/string.js:50:11
           break;
         }
       }
-      if (match) result.push(i);
+      if (false) result.push(i);
     }
 
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Survived] ConditionalExpression
algorithms/strings/string.js:50:11
           break;
         }
       }
-      if (match) result.push(i);
+      if (true) result.push(i);
     }
 

[Killed] EqualityOperator
algorithms/strings/string.js:53:9
       if (match) result.push(i);
     }
 
-    if (i < n - m) {
+    if (i >= n - m) {
       textHash =
         (base * (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i + m)) %
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] BlockStatement
algorithms/strings/string.js:53:20
       if (match) result.push(i);
     }
 
-    if (i < n - m) {
-      textHash =
-        (base * (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i + m)) %
-        prime;
-      if (textHash < 0) textHash += prime;
-    }
+    if (i < n - m) {}
   }
 
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ArithmeticOperator
algorithms/strings/string.js:55:9
 
     if (i < n - m) {
       textHash =
-        (base * (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i + m)) %
-        prime;
+        (base * (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i + m)) * prime;
       if (textHash < 0) textHash += prime;
     }
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ArithmeticOperator
algorithms/strings/string.js:55:18
 
     if (i < n - m) {
       textHash =
-        (base * (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i + m)) %
+        (base * (textHash + text.charCodeAt(i) * h) + text.charCodeAt(i + m)) %
         prime;
       if (textHash < 0) textHash += prime;
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ConditionalExpression
algorithms/strings/string.js:57:11
       textHash =
         (base * (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i + m)) %
         prime;
-      if (textHash < 0) textHash += prime;
+      if (false) textHash += prime;
     }
   }
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] AssignmentOperator
algorithms/strings/string.js:57:25
       textHash =
         (base * (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i + m)) %
         prime;
-      if (textHash < 0) textHash += prime;
+      if (textHash < 0) textHash -= prime;
     }
   }
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ConditionalExpression
algorithms/strings/string.js:66:7
 
 function knuthMorrisPratt(text, pattern) {
   const result = [];
-  if (pattern.length === 0) return result;
+  if (true) return result;
 
   const m = pattern.length;
killedBy: String Matching Algorithms knuthMorrisPratt should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Timeout] ConditionalExpression
algorithms/strings/string.js:66:7
 
 function knuthMorrisPratt(text, pattern) {
   const result = [];
-  if (pattern.length === 0) return result;
+  if (false) return result;
 
   const m = pattern.length;

[Timeout] BlockStatement
algorithms/strings/string.js:76:17
   computeLPS(pattern, lps);
 
   let i = 0;
-  while (i < n) {
-    if (pattern[j] === text[i]) {
-      i++;
-      j++;
-    }
-
-    if (j === m) {
-      result.push(i - j);
-      j = lps[j - 1];
-    } else if (i < n && pattern[j] !== text[i]) {
-      if (j !== 0) j = lps[j - 1];
-      else i++;
-    }
-  }
+  while (i < n) {}
 
   return result;

[Timeout] ConditionalExpression
algorithms/strings/string.js:77:9
 
   let i = 0;
   while (i < n) {
-    if (pattern[j] === text[i]) {
+    if (false) {
       i++;
       j++;

[Timeout] EqualityOperator
algorithms/strings/string.js:77:9
 
   let i = 0;
   while (i < n) {
-    if (pattern[j] === text[i]) {
+    if (pattern[j] !== text[i]) {
       i++;
       j++;

[Timeout] UpdateOperator
algorithms/strings/string.js:78:7
   let i = 0;
   while (i < n) {
     if (pattern[j] === text[i]) {
-      i++;
+      i--;
       j++;
     }

[Timeout] UpdateOperator
algorithms/strings/string.js:79:7
   while (i < n) {
     if (pattern[j] === text[i]) {
       i++;
-      j++;
+      j--;
     }
 

[Killed] ConditionalExpression
algorithms/strings/string.js:82:9
       j++;
     }
 
-    if (j === m) {
+    if (false) {
       result.push(i - j);
       j = lps[j - 1];
killedBy: String Matching Algorithms knuthMorrisPratt should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Timeout] EqualityOperator
algorithms/strings/string.js:82:9
       j++;
     }
 
-    if (j === m) {
+    if (j !== m) {
       result.push(i - j);
       j = lps[j - 1];

[Killed] ArithmeticOperator
algorithms/strings/string.js:83:19
     }
 
     if (j === m) {
-      result.push(i - j);
+      result.push(i + j);
       j = lps[j - 1];
     } else if (i < n && pattern[j] !== text[i]) {
killedBy: String Matching Algorithms knuthMorrisPratt should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   7,

[Timeout] ArithmeticOperator
algorithms/strings/string.js:84:15
 
     if (j === m) {
       result.push(i - j);
-      j = lps[j - 1];
+      j = lps[j + 1];
     } else if (i < n && pattern[j] !== text[i]) {
       if (j !== 0) j = lps[j - 1];

[Killed] ConditionalExpression
algorithms/strings/string.js:85:16
     if (j === m) {
       result.push(i - j);
       j = lps[j - 1];
-    } else if (i < n && pattern[j] !== text[i]) {
+    } else if (true) {
       if (j !== 0) j = lps[j - 1];
       else i++;
killedBy: String Matching Algorithms knuthMorrisPratt should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] LogicalOperator
algorithms/strings/string.js:85:16
     if (j === m) {
       result.push(i - j);
       j = lps[j - 1];
-    } else if (i < n && pattern[j] !== text[i]) {
+    } else if (i < n || pattern[j] !== text[i]) {
       if (j !== 0) j = lps[j - 1];
       else i++;
killedBy: String Matching Algorithms knuthMorrisPratt should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] EqualityOperator
algorithms/strings/string.js:86:11
       result.push(i - j);
       j = lps[j - 1];
     } else if (i < n && pattern[j] !== text[i]) {
-      if (j !== 0) j = lps[j - 1];
+      if (j === 0) j = lps[j - 1];
       else i++;
     }
killedBy: String Matching Algorithms knuthMorrisPratt should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Survived] ArithmeticOperator
algorithms/strings/string.js:86:28
       result.push(i - j);
       j = lps[j - 1];
     } else if (i < n && pattern[j] !== text[i]) {
-      if (j !== 0) j = lps[j - 1];
+      if (j !== 0) j = lps[j + 1];
       else i++;
     }

[Timeout] UpdateOperator
algorithms/strings/string.js:87:12
       j = lps[j - 1];
     } else if (i < n && pattern[j] !== text[i]) {
       if (j !== 0) j = lps[j - 1];
-      else i++;
+      else i--;
     }
   }

[Killed] BlockStatement
algorithms/strings/string.js:94:35
   return result;
 }
 
-function computeLPS(pattern, lps) {
-  let length = 0;
-  let i = 1;
-  lps[0] = 0;
-
-  while (i < pattern.length) {
-    if (pattern[i] === pattern[length]) {
-      length++;
-      lps[i] = length;
-      i++;
-    } else {
-      if (length !== 0) length = lps[length - 1];
-      else {
-        lps[i] = 0;
-        i++;
-      }
-    }
-  }
-}
+function computeLPS(pattern, lps) {}
 
 function boyerMoore(text, pattern) {
killedBy: String Matching Algorithms knuthMorrisPratt should find multiple matches
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    0,
-   1,

[Killed] ConditionalExpression
algorithms/strings/string.js:99:10
   let i = 1;
   lps[0] = 0;
 
-  while (i < pattern.length) {
+  while (false) {
     if (pattern[i] === pattern[length]) {
       length++;
killedBy: String Matching Algorithms knuthMorrisPratt should find multiple matches
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    0,
-   1,

[Timeout] BlockStatement
algorithms/strings/string.js:99:30
   let i = 1;
   lps[0] = 0;
 
-  while (i < pattern.length) {
-    if (pattern[i] === pattern[length]) {
-      length++;
-      lps[i] = length;
-      i++;
-    } else {
-      if (length !== 0) length = lps[length - 1];
-      else {
-        lps[i] = 0;
-        i++;
-      }
-    }
-  }
+  while (i < pattern.length) {}
 }
 

[Killed] EqualityOperator
algorithms/strings/string.js:100:9
   lps[0] = 0;
 
   while (i < pattern.length) {
-    if (pattern[i] === pattern[length]) {
+    if (pattern[i] !== pattern[length]) {
       length++;
       lps[i] = length;
killedBy: String Matching Algorithms knuthMorrisPratt should find multiple matches
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    0,
-   1,

[Killed] ConditionalExpression
algorithms/strings/string.js:100:9
   lps[0] = 0;
 
   while (i < pattern.length) {
-    if (pattern[i] === pattern[length]) {
+    if (false) {
       length++;
       lps[i] = length;
killedBy: String Matching Algorithms knuthMorrisPratt should find multiple matches
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    0,
-   1,

[Timeout] UpdateOperator
algorithms/strings/string.js:101:7
 
   while (i < pattern.length) {
     if (pattern[i] === pattern[length]) {
-      length++;
+      length--;
       lps[i] = length;
       i++;

[Timeout] UpdateOperator
algorithms/strings/string.js:103:7
     if (pattern[i] === pattern[length]) {
       length++;
       lps[i] = length;
-      i++;
+      i--;
     } else {
       if (length !== 0) length = lps[length - 1];

[Timeout] BlockStatement
algorithms/strings/string.js:104:12
       length++;
       lps[i] = length;
       i++;
-    } else {
-      if (length !== 0) length = lps[length - 1];
-      else {
-        lps[i] = 0;
-        i++;
-      }
-    }
+    } else {}
   }
 }

[Timeout] ConditionalExpression
algorithms/strings/string.js:105:11
       lps[i] = length;
       i++;
     } else {
-      if (length !== 0) length = lps[length - 1];
+      if (true) length = lps[length - 1];
       else {
         lps[i] = 0;

[Survived] ConditionalExpression
algorithms/strings/string.js:105:11
       lps[i] = length;
       i++;
     } else {
-      if (length !== 0) length = lps[length - 1];
+      if (false) length = lps[length - 1];
       else {
         lps[i] = 0;

[Timeout] BlockStatement
algorithms/strings/string.js:106:12
       i++;
     } else {
       if (length !== 0) length = lps[length - 1];
-      else {
-        lps[i] = 0;
-        i++;
-      }
+      else {}
     }
   }

[Timeout] UpdateOperator
algorithms/strings/string.js:108:9
       if (length !== 0) length = lps[length - 1];
       else {
         lps[i] = 0;
-        i++;
+        i--;
       }
     }

[Killed] BlockStatement
algorithms/strings/string.js:114:36
   }
 }
 
-function boyerMoore(text, pattern) {
-  const result = [];
-  const n = text.length;
-  const m = pattern.length;
-  if (m === 0) return result;
-
-  const badChar = preprocessBadChar(pattern);
-
-  let shift = 0;
-  while (shift <= n - m) {
-    let j = m - 1;
-    while (j >= 0 && pattern[j] === text[shift + j]) j--;
-
-    if (j < 0) {
-      result.push(shift);
-      shift += shift + m < n ? m - badChar[text.charCodeAt(shift + m)] : 1;
-    } else {
-      shift += Math.max(1, j - badChar[text.charCodeAt(shift + j)]);
-    }
-  }
-
-  return result;
-}
+function boyerMoore(text, pattern) {}
 
 function preprocessBadChar(pattern) {
killedBy: String Matching Algorithms boyerMoore should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1]
Received: undefined

[Killed] EqualityOperator
algorithms/strings/string.js:118:7
   const result = [];
   const n = text.length;
   const m = pattern.length;
-  if (m === 0) return result;
+  if (m !== 0) return result;
 
   const badChar = preprocessBadChar(pattern);
killedBy: String Matching Algorithms boyerMoore should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]
