[Killed] ConditionalExpression
algorithms/strings/string.js:118:7
   const result = [];
   const n = text.length;
   const m = pattern.length;
-  if (m === 0) return result;
+  if (true) return result;
 
   const badChar = preprocessBadChar(pattern);
killedBy: String Matching Algorithms boyerMoore should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] EqualityOperator
algorithms/strings/string.js:123:10
   const badChar = preprocessBadChar(pattern);
 
   let shift = 0;
-  while (shift <= n - m) {
+  while (shift < n - m) {
     let j = m - 1;
     while (j >= 0 && pattern[j] === text[shift + j]) j--;
killedBy: String Matching Algorithms boyerMoore should find multiple matches
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    0,
    1,

[Killed] ConditionalExpression
algorithms/strings/string.js:123:10
   const badChar = preprocessBadChar(pattern);
 
   let shift = 0;
-  while (shift <= n - m) {
+  while (false) {
     let j = m - 1;
     while (j >= 0 && pattern[j] === text[shift + j]) j--;
killedBy: String Matching Algorithms boyerMoore should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ArithmeticOperator
algorithms/strings/string.js:124:13
 
   let shift = 0;
   while (shift <= n - m) {
-    let j = m - 1;
+    let j = m + 1;
     while (j >= 0 && pattern[j] === text[shift + j]) j--;
 
killedBy: String Matching Algorithms boyerMoore should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ConditionalExpression
algorithms/strings/string.js:125:22
   let shift = 0;
   while (shift <= n - m) {
     let j = m - 1;
-    while (j >= 0 && pattern[j] === text[shift + j]) j--;
+    while (j >= 0 && true) j--;
 
     if (j < 0) {
killedBy: String Matching Algorithms boyerMoore should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   0,
    1,

[Killed] ConditionalExpression
algorithms/strings/string.js:125:12
   let shift = 0;
   while (shift <= n - m) {
     let j = m - 1;
-    while (j >= 0 && pattern[j] === text[shift + j]) j--;
+    while (false) j--;
 
     if (j < 0) {
killedBy: String Matching Algorithms boyerMoore should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ConditionalExpression
algorithms/strings/string.js:127:9
     let j = m - 1;
     while (j >= 0 && pattern[j] === text[shift + j]) j--;
 
-    if (j < 0) {
+    if (true) {
       result.push(shift);
       shift += shift + m < n ? m - badChar[text.charCodeAt(shift + m)] : 1;
killedBy: String Matching Algorithms boyerMoore should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   0,
    1,

[Killed] EqualityOperator
algorithms/strings/string.js:127:9
     let j = m - 1;
     while (j >= 0 && pattern[j] === text[shift + j]) j--;
 
-    if (j < 0) {
+    if (j >= 0) {
       result.push(shift);
       shift += shift + m < n ? m - badChar[text.charCodeAt(shift + m)] : 1;
killedBy: String Matching Algorithms boyerMoore should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 2

  Array [
-   1,
+   0,

[Killed] AssignmentOperator
algorithms/strings/string.js:129:7
 
     if (j < 0) {
       result.push(shift);
-      shift += shift + m < n ? m - badChar[text.charCodeAt(shift + m)] : 1;
+      shift -= shift + m < n ? m - badChar[text.charCodeAt(shift + m)] : 1;
     } else {
       shift += Math.max(1, j - badChar[text.charCodeAt(shift + j)]);
killedBy: String Matching Algorithms boyerMoore should find multiple matches
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 0

  Array [
    0,
-   1,

[Killed] ArithmeticOperator
algorithms/strings/string.js:129:60
 
     if (j < 0) {
       result.push(shift);
-      shift += shift + m < n ? m - badChar[text.charCodeAt(shift + m)] : 1;
+      shift += shift + m < n ? m - badChar[text.charCodeAt(shift - m)] : 1;
     } else {
       shift += Math.max(1, j - badChar[text.charCodeAt(shift + j)]);
killedBy: String Matching Algorithms boyerMoore should find multiple matches
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 0

  Array [
    0,
-   1,

[Timeout] BlockStatement
algorithms/strings/string.js:130:12
     if (j < 0) {
       result.push(shift);
       shift += shift + m < n ? m - badChar[text.charCodeAt(shift + m)] : 1;
-    } else {
-      shift += Math.max(1, j - badChar[text.charCodeAt(shift + j)]);
-    }
+    } else {}
   }
 

[Killed] ArithmeticOperator
algorithms/strings/string.js:131:56
       result.push(shift);
       shift += shift + m < n ? m - badChar[text.charCodeAt(shift + m)] : 1;
     } else {
-      shift += Math.max(1, j - badChar[text.charCodeAt(shift + j)]);
+      shift += Math.max(1, j - badChar[text.charCodeAt(shift - j)]);
     }
   }
killedBy: String Matching Algorithms boyerMoore should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] AssignmentOperator
algorithms/strings/string.js:131:7
       result.push(shift);
       shift += shift + m < n ? m - badChar[text.charCodeAt(shift + m)] : 1;
     } else {
-      shift += Math.max(1, j - badChar[text.charCodeAt(shift + j)]);
+      shift -= Math.max(1, j - badChar[text.charCodeAt(shift + j)]);
     }
   }
killedBy: String Matching Algorithms boyerMoore should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] BlockStatement
algorithms/strings/string.js:138:37
   return result;
 }
 
-function preprocessBadChar(pattern) {
-  const badChar = Array(256).fill(-1);
-  for (let i = 0; i < pattern.length; i++) {
-    badChar[pattern.charCodeAt(i)] = i;
-  }
-  return badChar;
-}
+function preprocessBadChar(pattern) {}
 
 module.exports = {
killedBy: String Matching Algorithms boyerMoore should find single match
statusReason: TypeError: Cannot read properties of undefined (reading '101')

[Survived] UnaryOperator
algorithms/strings/string.js:139:35
 }
 
 function preprocessBadChar(pattern) {
-  const badChar = Array(256).fill(-1);
+  const badChar = Array(256).fill(+1);
   for (let i = 0; i < pattern.length; i++) {
     badChar[pattern.charCodeAt(i)] = i;

[Killed] BlockStatement
algorithms/strings/string.js:140:44
 
 function preprocessBadChar(pattern) {
   const badChar = Array(256).fill(-1);
-  for (let i = 0; i < pattern.length; i++) {
-    badChar[pattern.charCodeAt(i)] = i;
-  }
+  for (let i = 0; i < pattern.length; i++) {}
   return badChar;
 }
killedBy: String Matching Algorithms boyerMoore should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] EqualityOperator
algorithms/strings/string.js:140:19
 
 function preprocessBadChar(pattern) {
   const badChar = Array(256).fill(-1);
-  for (let i = 0; i < pattern.length; i++) {
+  for (let i = 0; i >= pattern.length; i++) {
     badChar[pattern.charCodeAt(i)] = i;
   }
killedBy: String Matching Algorithms boyerMoore should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ObjectLiteral
algorithms/strings/string.js:146:18
   return badChar;
 }
 
-module.exports = {
-  naiveStringMatching,
-  rabinKarp,
-  knuthMorrisPratt,
-  boyerMoore,
-};
+module.exports = {};
 
killedBy: String Matching Algorithms naiveStringMatching should find single match
statusReason: TypeError: naiveStringMatching is not a function
