[Killed] ConditionalExpression
algorithms/graph/graph.js:116:9
   const graph = {};
   for (const [u, v, w] of edges) {
     if (!(u in graph)) graph[u] = [];
-    if (!(v in graph)) graph[v] = [];
+    if (true) graph[v] = [];
     graph[u].push([v, w]);
     graph[v].push([u, w]);
killedBy: Graph Integration Tests Kruskal MST weight vs Prim
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: 3
