[Killed] ConditionalExpression
algorithms/searching/search.js:27:7
   const mid2 = right - third;
 
   if (arr[mid1] === target) return mid1;
-  if (arr[mid2] === target) return mid2;
+  if (false) return mid2;
 
   if (target < arr[mid1]) return ternarySearch(arr, target, left, mid1 - 1);
killedBy: Integration Tests: Search Algorithms Large array search integration
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3000
Received: -1
