[Killed] BlockStatement
algorithms/strings/string.js:1:45
-function naiveStringMatching(text, pattern) {
-  const result = [];
-  const n = text.length;
-  const m = pattern.length;
-  if (m === 0) {
-    for (let i = 0; i <= n; i++) result.push(i);
-    return result;
-  }
-
-  for (let i = 0; i <= n - m; i++) {
-    let j;
-    for (j = 0; j < m; j++) {
-      if (text[i + j] !== pattern[j]) break;
-    }
-    if (j === m) result.push(i);
-  }
-
-  return result;
-}
+function naiveStringMatching(text, pattern) {}
 
 function rabinKarp(text, pattern, prime = 101) {
killedBy: String Matching Algorithms naiveStringMatching should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1]
Received: undefined

[Killed] EqualityOperator
algorithms/strings/string.js:5:7
   const result = [];
   const n = text.length;
   const m = pattern.length;
-  if (m === 0) {
+  if (m !== 0) {
     for (let i = 0; i <= n; i++) result.push(i);
     return result;
killedBy: String Matching Algorithms naiveStringMatching should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 5

  Array [
+   0,
    1,

[Killed] ConditionalExpression
algorithms/strings/string.js:10:19
     return result;
   }
 
-  for (let i = 0; i <= n - m; i++) {
+  for (let i = 0; false; i++) {
     let j;
     for (j = 0; j < m; j++) {
killedBy: String Matching Algorithms naiveStringMatching should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] EqualityOperator
algorithms/strings/string.js:12:17
 
   for (let i = 0; i <= n - m; i++) {
     let j;
-    for (j = 0; j < m; j++) {
+    for (j = 0; j >= m; j++) {
       if (text[i + j] !== pattern[j]) break;
     }
killedBy: String Matching Algorithms naiveStringMatching should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ArithmeticOperator
algorithms/strings/string.js:13:16
   for (let i = 0; i <= n - m; i++) {
     let j;
     for (j = 0; j < m; j++) {
-      if (text[i + j] !== pattern[j]) break;
+      if (text[i - j] !== pattern[j]) break;
     }
     if (j === m) result.push(i);
killedBy: String Matching Algorithms naiveStringMatching should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] EqualityOperator
algorithms/strings/string.js:15:9
     for (j = 0; j < m; j++) {
       if (text[i + j] !== pattern[j]) break;
     }
-    if (j === m) result.push(i);
+    if (j !== m) result.push(i);
   }
 
killedBy: String Matching Algorithms naiveStringMatching should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 2

  Array [
-   1,
+   0,

[Killed] ArrayDeclaration
algorithms/strings/string.js:22:18
 }
 
 function rabinKarp(text, pattern, prime = 101) {
-  const result = [];
+  const result = ["Stryker was here"];
   const n = text.length;
   const m = pattern.length;
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "Stryker was here",
    1,

[Killed] ConditionalExpression
algorithms/strings/string.js:25:8
   const result = [];
   const n = text.length;
   const m = pattern.length;
-   if (m === 0) {
+   if (false) {
      for (let i = 0; i <= n; i++) result.push(i);
      return result;
killedBy: String Algorithms Integration Tests Algorithms handle empty pattern
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 11
+ Received  +  0

  Array [
    0,
-   1,

[Killed] BlockStatement
algorithms/strings/string.js:40:31
     h = (h * base) % prime;
   }
 
-  for (let i = 0; i < m; i++) {
-    patternHash = (base * patternHash + pattern.charCodeAt(i)) % prime;
-    textHash = (base * textHash + text.charCodeAt(i)) % prime;
-  }
+  for (let i = 0; i < m; i++) {}
 
   for (let i = 0; i <= n - m; i++) {
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ConditionalExpression
algorithms/strings/string.js:40:19
     h = (h * base) % prime;
   }
 
-  for (let i = 0; i < m; i++) {
+  for (let i = 0; false; i++) {
     patternHash = (base * patternHash + pattern.charCodeAt(i)) % prime;
     textHash = (base * textHash + text.charCodeAt(i)) % prime;
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ArithmeticOperator
algorithms/strings/string.js:41:20
   }
 
   for (let i = 0; i < m; i++) {
-    patternHash = (base * patternHash + pattern.charCodeAt(i)) % prime;
+    patternHash = (base * patternHash - pattern.charCodeAt(i)) % prime;
     textHash = (base * textHash + text.charCodeAt(i)) % prime;
   }
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ConditionalExpression
algorithms/strings/string.js:46:9
   }
 
   for (let i = 0; i <= n - m; i++) {
-    if (patternHash === textHash) {
+    if (false) {
       let match = true;
       for (let j = 0; j < m; j++) {
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Survived] BlockStatement
algorithms/strings/string.js:48:35
   for (let i = 0; i <= n - m; i++) {
     if (patternHash === textHash) {
       let match = true;
-      for (let j = 0; j < m; j++) {
-        if (text[i + j] !== pattern[j]) {
-          match = false;
-          break;
-        }
-      }
+      for (let j = 0; j < m; j++) {}
       if (match) result.push(i);
     }

[Killed] ArithmeticOperator
algorithms/strings/string.js:49:18
     if (patternHash === textHash) {
       let match = true;
       for (let j = 0; j < m; j++) {
-        if (text[i + j] !== pattern[j]) {
+        if (text[i - j] !== pattern[j]) {
           match = false;
           break;
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ConditionalExpression
algorithms/strings/string.js:57:9
       if (match) result.push(i);
     }
 
-    if (i < n - m) {
+    if (false) {
       textHash =
         (base * (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i + m)) %
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ArithmeticOperator
algorithms/strings/string.js:59:29
 
     if (i < n - m) {
       textHash =
-        (base * (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i + m)) %
+        (base * (textHash - text.charCodeAt(i) / h) + text.charCodeAt(i + m)) %
         prime;
       if (textHash < 0) textHash += prime;
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] EqualityOperator
algorithms/strings/string.js:61:11
       textHash =
         (base * (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i + m)) %
         prime;
-      if (textHash < 0) textHash += prime;
+      if (textHash >= 0) textHash += prime;
     }
   }
killedBy: String Matching Algorithms rabinKarp should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ConditionalExpression
algorithms/strings/string.js:74:21
   const n=text.length;
   const m = pattern.length;
   if (m === 0) {
-    for (let i = 0; i <= n; i++) result.push(i);
+    for (let i = 0; false; i++) result.push(i);
     return result;
   }
killedBy: String Matching Algorithms knuthMorrisPratt should handle empty pattern
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   0,
-   1,

[Killed] ConditionalExpression
algorithms/strings/string.js:93:25
     if (j === m) {
       result.push(i - j);
       j = lps[j - 1];
-    } else if (i < n && pattern[j] !== text[i]) {
+    } else if (i < n && true) {
       if (j !== 0) j = lps[j - 1];
       else i++;
killedBy: String Matching Algorithms knuthMorrisPratt should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Survived] ConditionalExpression
algorithms/strings/string.js:94:11
       result.push(i - j);
       j = lps[j - 1];
     } else if (i < n && pattern[j] !== text[i]) {
-      if (j !== 0) j = lps[j - 1];
+      if (false) j = lps[j - 1];
       else i++;
     }

[Survived] EqualityOperator
algorithms/strings/string.js:107:10
   let i = 1;
   lps[0] = 0;
 
-  while (i < pattern.length) {
+  while (i <= pattern.length) {
     if (pattern[i] === pattern[length]) {
       length++;

[Killed] ArrayDeclaration
algorithms/strings/string.js:123:18
 }
 
 function boyerMoore(text, pattern) {
-  const result = [];
+  const result = ["Stryker was here"];
   const n = text.length;
   const m = pattern.length;
killedBy: String Matching Algorithms boyerMoore should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "Stryker was here",
    1,

[Killed] ArithmeticOperator
algorithms/strings/string.js:136:42
   let shift = 0;
   while (shift <= n - m) {
     let j = m - 1;
-    while (j >= 0 && pattern[j] === text[shift + j]) j--;
+    while (j >= 0 && pattern[j] === text[shift - j]) j--;
 
     if (j < 0) {
killedBy: String Matching Algorithms boyerMoore should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ArithmeticOperator
algorithms/strings/string.js:140:32
 
     if (j < 0) {
       result.push(shift);
-      shift += shift + m < n ? m - badChar[text.charCodeAt(shift + m)] : 1;
+      shift += shift + m < n ? m + badChar[text.charCodeAt(shift + m)] : 1;
     } else {
       shift += Math.max(1, j - badChar[text.charCodeAt(shift + j)]);
killedBy: String Matching Algorithms boyerMoore should find multiple matches
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 0

  Array [
    0,
-   1,

[Killed] ArithmeticOperator
algorithms/strings/string.js:142:28
       result.push(shift);
       shift += shift + m < n ? m - badChar[text.charCodeAt(shift + m)] : 1;
     } else {
-      shift += Math.max(1, j - badChar[text.charCodeAt(shift + j)]);
+      shift += Math.max(1, j + badChar[text.charCodeAt(shift + j)]);
     }
   }
killedBy: String Algorithms Integration Tests All algorithms find same positions for a given pattern
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    0,
+   7,

[Killed] ConditionalExpression
algorithms/strings/string.js:151:19
 
 function preprocessBadChar(pattern) {
   const badChar = Array(256).fill(-1);
-  for (let i = 0; i < pattern.length; i++) {
+  for (let i = 0; false; i++) {
     badChar[pattern.charCodeAt(i)] = i;
   }
killedBy: String Matching Algorithms boyerMoore should find single match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]
